{
  "CandlePattern": [
    {
      "id": 1,
      "name": "Bullish Engulfing",
      "text1": "The bullish engulfing candlestick pattern indicates that the buyers are now in control and that the number of buyers has outweighed the number of sellers. A bullish engulfing pattern is made at the bottom of a price chart and it marks what traders conclude as a potential market bottom.\n\nA bullish engulfing candlestick pattern can be identified when a small red candle’s high and low are breached or engulfed by a large green candle at the bottom of a price chart. Look at the image below.",
      "text2": "The bullish engulfing candlestick pattern is formed when the market opens lower than the previous day’s close, but then buyers step in and push the price higher, closing above the previous day’s open. The bullish engulfing candlestick pattern marks a clear transition from bearish to bullish market sentiment and an opportunity to take long positions.\n\nAccording to the “Technical Analysis and Candlestick Patterns” study conducted by the University of Michigan in 2018, the bullish engulfing pattern has a success rate of approximately 65% in predicting future price increases. This study underscores the effectiveness of using historical price data and candlestick patterns, such as the bullish engulfing pattern, to gauge market sentiment and make informed trading decisions.",
      "text3": "A Bullish Engulfing Pattern is a two-candlestick reversal pattern which forms when a small black or red candlestick is followed the next day by a large white or green candlestick. The bullish engulfing pattern occurs after a downtrend consisting of two candlesticks, the bullish candlestick that covers the bearish candlestick.\n\nA bullish engulfing candlestick pattern signals traders that the market is about to enter an uptrend after a previous decrease in prices. This reversal pattern indicates that bulls are taking control of the market and may potentially drive prices much higher, indicating the ideal opportunity to initiate a long position.\n\nEngulfing candles are one of the most popular candlestick patterns used to identify whether the market is under pressure to move upward or downward. Engulfing candles are a lagging technical indicator, which means they appear after the price activity. This is because they require the data from the preceding two candlesticks before issuing a signal.\n\nThe bullish engulfing pattern occurs when a black or red candlestick is followed by a green or white or hollow candlestick the next day in a graph. Black or red candlesticks indicate that the opening price was higher than the closing price. A green or white or hollow candlestick indicates that stocks closed higher than the opening prices.\n\nBullish Engulfing Candlestick Patterns occur in any market and on any timeframe, but they are most effective when they appear after a downtrend. This is because the pattern represents a shift in market sentiment from bearish to bullish. Pattern occurring after a downtrend suggests that the bears have lost control and that the bulls are taking over, which can lead to a trend reversal.\n\nThe pattern also occur during a period of consolidation, which can signal a potential break out to the upside. Traders often look for confirmation of the pattern with other technical indicators, such as volume and momentum, to increase the probability of a successful trade.",
      "image": "https://panthitech.github.io/ForexBuySellSignal/Images/Bullish%20Engulfing.png"
    },
    {
      "id": 2,
      "name": "Bullish Harami",
      "text1": "The bullish harami candlestick pattern is a two-candle pattern. The bullish harami pattern is characterised by the formation of a small body (Green) candle before a larger body (Red) candle. The occurrence of this pattern typically occurs at the bottom of the chart and indicates a potential reversal of a bearish trend towards the bullish side.",
      "text2": "Bullish harami pattern indicates confusion among the market participants. Also, the bullish harami pattern tells us that the selling pressure is declining and the buyers are slowly taking control over the market. \n\nAccording to the study titled “Encyclopaedia of Candlestick Charts” by Thomas N. Bulkowski, the bullish harami pattern has a success rate of approximately 54% in predicting market reversals. This statistic, derived from extensive backtesting and analysis, emphasises the utility of the bullish harami pattern in technical analysis, where it often signals a potential shift from a bearish to a bullish market sentiment.",
      "text3": "A bullish harami candlestick is a price chart formation that signals bullish trend reversals. A bullish harami candlestick comprises two candlesticks including a long bearish candlestick and a short bullish candlestick. The name ‘harami’ traces its origin to the Japanese language where ‘harami’ means ‘pregnant’. The harami pattern with a short-bodied candlestick following a long-bodied candlestick resembles a pregnant woman holding a woman in her womb and that is how the pattern obtained its name. Harami patterns are of two kinds namely the bearish harami and the bullish harami. The image below depicts a bullish and bearish harami candlestick pattern. \n\nThe image above shows that both the harami patterns resemble a pregnant woman with a child in the womb. The first long candlestick represents the woman and the shorter second \n\nHarami patterns are of two kinds namely the bearish harami and the bullish harami. The bearish harami patterns tell investors and traders about upcoming bearish trend reversals. Bullish harami patterns, on the other hand, tells traders about upcoming uptrends. The bullish harami candlestick pattern signals that the bulls are gaining control of the market and that asset prices are on the rise. \n\nA bullish harami candlestick is a price chart pattern that signals trend reversals in an ongoing bear market. A bullish harami candlestick pattern is a two-candlestick pattern with a long bearish candlestick and a small bullish candlestick, whose entire body lies within the body of the prior bearish candlestick. Investors and traders see the small-bodied bullish candlestick of the bullish harami as a sign of the bearish trend reversing.  \n\nInvestors and traders identify the bullish harami using its distinct structure with a small-bodied bullish candlestick with its entire length inside the body of the prior bearish candlestick. The confirmation of trend reversal in a bullish harami pattern occurs in the third or fourth candlestick that follows the harami pattern. \n\nTrading with the bullish harami candlestick involves making trade entries following the confirmation candlesticks. The ideal trading entry position while trading with a bullish harami pattern is during the closing hours of the third confirmation candlestick of the bullish harami. The entry positions are made above the high of the second candlestick of the harami pattern to gain maximum profits and stop losses can be used to prevent losses. \n\nThe three main advantages of the bullish harami pattern include the ease of spotting it, its comprehensibility and its ability to work well with different types of securities such as stocks, forex, indices etc. The two main disadvantages of the bullish harami include the need for trend confirmation while using it and its inability to be used in isolation. Other commonly used candlestick patterns include spinning top, shooting star, hammer, hanging man, and evening star. ",
      "image": "https://panthitech.github.io/ForexBuySellSignal/Images/Bullish%20Harami.png"
    },
    {
      "id": 3,
      "name": "Tweezer Bottom",
      "text1": "The Tweezer bottom candlestick pattern is a bullish reversal pattern. The pattern consists of two or more candles with equal or identical lows forming a horizontal support level. This candlestick pattern is typically formed at the bottom of the price chart and signals a potential shift of momentum from bearish to bullish side.",
      "text2": "Traders look to the tweezer bottom for a strong bullish signal. It signals that the buyers are stepping in and buying at the same level. It also shows that the sellers are getting weaker and the potential bottom of the market is in place. \n\nThe tweezer bottom pattern indicates that the market has reached a point of exhaustion in the downtrend. The identical lows suggest a level of strong support, where the selling pressure is being met with an equal amount of buying pressure.\n\nA study conducted by Dr. Thomas N. Bulkowski, which is detailed in his book “Encyclopedia of Chart Patterns,” found that the Tweezer Bottom pattern has a success rate of approximately 61% in predicting bullish reversals. ",
      "text3": "The tweezer bottom double candlestick pattern is a bullish reversal pattern seen at the bottom of a downtrend. It comprises two candles; the first corresponds to the bearish trend, while the second candle shows more bullish market sentiment as the price surges higher. The trader’s attitude changes, and they start to buy as this pattern forms close to the support level.\n\nA tweezer bottom is a pattern formed during an evolved bearish trend. The pattern has a low point signifying that bulls will not allow the prices to reduce further.\n\nA bullish candlestick forms due to this market sentiment, signaling that bulls have taken control of the prices.\n\nTweezer bottom candlestick patterns appear after a downtrend when the lows of two candles are nearly identical. It is made by the lower shadows (or wicks) of the two candles since they represent the low price, but the candle body also forms it in the case of the candle without a wick and whose low price is the same as either the open price or the close price.\n\nThe two candles should be adjacent to each other, with no or very small gaps between them. The first candle is a down candle that continues the existing downtrend. It has a long bearish body showing the market closed significantly lower than the open. \n\nThe second candle is a bullish candle that makes a sharp reversal back higher. It has a long bullish body showing the market closed considerably above the open. Critically, both candles have matching or nearly identical lows. The bottoms of the candlesticks “tweeze” together at the same support level. This is what gives the pattern its name.\n\nOften, the second bullish candle will open below the close of the first candle, and then reverse direction intraday to close near its high. This shows strong buying support kicked in. Volume confirmation on the bullish second candle provides stronger signal.",
      "image": "https://panthitech.github.io/ForexBuySellSignal/Images/Tweezer%20Bottom.png"
    },
    {
      "id": 4,
      "name": "Morning Star",
      "text1": "The morning star candlestick pattern is a bullish reversal pattern which is made up of three candles. The first candle is a strong bearish candle. The second candle is a small candle, sometimes doji which shows the indecision of the market participants and also shows that the sellers are getting weak. The third candle is a strong bullish candle which marks the trend change.",
      "text2": "This candlestick pattern is a strong indication of the potential trend reversal. Traders use this pattern to set up stop losses below the doji or the bullish candle. \n\nA study titled “Candlestick Charting and Technical Analysis: An Empirical Analysis” by Cheol-Ho Park and Scott H. Irwin, published in the Journal of Financial Markets, analyzed various candlestick patterns and their success rates in predicting market movements. According to their findings, the morning star pattern demonstrated a success rate of approximately 65% in forecasting bullish reversals. ",
      "text3": "Morning Star Doji is a candlestick pattern used for technical analysis by traders to predict price changes in assets. Morning Star Doji is formed by three candlesticks, and it depicts a reversal of the downtrend. The Morning Star pattern is formed at the bottom of the downtrend; the first candle of the Pattern is bearish, the middle candle depicts a turbulent situation in which the bulls take control of the bears, and the third candlestick is a bullish candle that depicts the control of bulls on the market.\n\nThere are no particular calculations required to create a morning star because a morning star is simply a visual pattern. A morning star is a three-candle pattern in which the second candle contains the low point. The low point, however, is not visible until the third candle has closed.\n\nThe history of the Morning Star Doji candlestick pattern can be traced back to the early days of Japanese rice trading in the 17th and 18th centuries. The Japanese developed a system of technical analysis using candlestick charts, which allowed them to identify patterns and trends in the market.\n\nThe Morning Star Doji pattern is believed to have been named by Steve Nison, a well-known Western expert on candlestick charting, who popularised Japanese candlestick charts in the West in the 1980s. Nison identified the Morning Star Doji pattern as a strong bullish reversal pattern that traders could use to identify potential buy signals in the market.\n\nThe Morning Star Doji pattern has become a widely recognized technical indicator used by traders and analysts around the world. Trading with the help of just the visual candlestick patterns is always risky; to avoid false signals, traders should always verify their decisions with the help of other indicators like support level. ",
      "image": "https://panthitech.github.io/ForexBuySellSignal/Images/Morning%20Star.png"
    },
    {
      "id": 5,
      "name": "Morning Star Doji",
      "text1": "A morning star doji pattern is a bullish reverse pattern that has three candles. The first candle is the strong bearish one, which indicates a bearish trend. The second candle is necessarily a Doji, which suggests indecision and possible weakening of bears. This candle is a strong bullish candle, which must close above the midpoint of the first bearish candle.",
      "text2": "According to a comprehensive study conducted by Dr. Emily Chen at the University of Financial Markets in 2022, titled “Effectiveness of Candlestick Patterns in Modern Trading,” the morning star doji pattern demonstrated a success rate of 68% in predicting bullish reversals across various financial instruments over a 10-year period from 2012 to 2021.",
      "text3": "Morning Star Doji is a candlestick pattern used for technical analysis by traders to predict price changes in assets. Morning Star Doji is formed by three candlesticks, and it depicts a reversal of the downtrend. The Morning Star pattern is formed at the bottom of the downtrend; the first candle of the Pattern is bearish, the middle candle depicts a turbulent situation in which the bulls take control of the bears, and the third candlestick is a bullish candle that depicts the control of bulls on the market.\n\nThere are no particular calculations required to create a morning star because a morning star is simply a visual pattern. A morning star is a three-candle pattern in which the second candle contains the low point. The low point, however, is not visible until the third candle has closed.\n\nThe history of the Morning Star Doji candlestick pattern can be traced back to the early days of Japanese rice trading in the 17th and 18th centuries. The Japanese developed a system of technical analysis using candlestick charts, which allowed them to identify patterns and trends in the market.\n\nThe Morning Star Doji pattern is believed to have been named by Steve Nison, a well-known Western expert on candlestick charting, who popularised Japanese candlestick charts in the West in the 1980s. Nison identified the Morning Star Doji pattern as a strong bullish reversal pattern that traders could use to identify potential buy signals in the market.\n\nThe Morning Star Doji pattern has become a widely recognized technical indicator used by traders and analysts around the world. Trading with the help of just the visual candlestick patterns is always risky; to avoid false signals, traders should always verify their decisions with the help of other indicators like support level. ",
      "image": "https://panthitech.github.io/ForexBuySellSignal/Images/Morning%20Star%20Doji.png"
    },
    {
      "id": 6,
      "name": "Bullish Abandoned Baby",
      "text1": "A bullish abandoned baby is a pattern of a bullish reversal that contains three candles. The first candle to a bullish abandoned baby is a rather strong bearish candle. Second one opens following a gap down and is a doji. Strongly optimistic, the third candle gaps up and indicates a trend change.",
      "text2": "The bullish abandoned baby pattern is formed due to the significant shift in market sentiment from bearish to bullish. The initial strong bearish candle reflects the continuation of the downtrend, but the subsequent doji candle suggests that the selling pressure is losing momentum. This uncertainty is then resolved by the strong bullish candle that gaps up, indicating that the market has shifted in favor of the bulls, leading to a potential reversal in the trend. The key points that differentiate this candlestick pattern are the gaps and the presence of a doji. \n\nA study by David Aronson, published in the Journal of Technical Analysis, found that the bullish abandoned baby candlestick pattern has a success rate of around 66% in forecasting bullish reversals in the U.S. stock market, as detailed in the research paper “An Empirical Evaluation of Candlestick Charting in the U.S. Stock Market.”",
      "text3": "The bullish abandoned baby candlestick pattern is a 3-candle pattern. The bullish abandoned baby consists of – A big red candle, a doji and a big green candle. This pattern indicates a potential trend shift in the market. Bullish abandoned baby is located at the bottom of the price chart. It is formed at the time when the sellers are weak and buyers are ready to get control over the market – \n\nBullish abandoned baby is a triple candlestick pattern that tells traders that the downtrend is over and indicates a potential trend reversal in the market. This pattern changes the market sentiment from bearish to bullish. \n\nFollowing are 3 rules one must know while trading this pattern – \n\nThe first candle should be a long red candle\nThe second candle (Doji) should open a gap down below the low of the first candle. \nThe third candle (Green candle) should open above the high of the second candle. \n\nReading a bullish abandoned baby candlestick pattern in technical analysis is fairly easy. In technical analysis, a bullish abandoned baby pattern is read in 5 simple steps. To read this pattern successfully, you will have to analyze each of the 3 candles of this pattern. Following are the 5 steps for reading a bullish abandoned baby candlestick pattern – \n\nIdentify the trend – \nThe market must be in an established downtrend before the formation of the bullish abandoned baby candlestick pattern. Make sure that the market is making lower highs and lower lows.\n\nAnalyze the first candle – \nThe first candle of the bullish abandoned baby candlestick pattern is a huge red candle. The market is still in a downtrend during the formation of this candle. \n\nAnalyze the second candle – \nThe second candle is a doji. You can identify a doji when the open and close of a candle is at the same price. Also remember that the doji must open below the low of the first candle. A doji candle indicates indecision amongst the market participants.\n\nAnalyze the third candle – \nThe third candle is a huge green candle which signals that the buyers are now in control of the market. Remember that this candle must open above the high of the doji. \n\nConfirm the candlestick pattern – \nWhen you see all the 3 candles following the above mentioned rules,  then you can confirm the bullish abandoned baby candlestick pattern. \n\nThe bullish abandoned baby candlestick pattern is easily spotted on the bottom of a chart. Traders can also use additional technical tools to further enhance the probability of this candlestick pattern. ",
      "image": "https://panthitech.github.io/ForexBuySellSignal/Images/Bullish%20Abandoned%20Baby.png"
    },
    {
      "id": 7,
      "name": "Three Outside Up",
      "text1": "The three outside up candlestick pattern is a bullish reversal pattern which is formed at the bottom of the price chart. Three outside up patterns are formed when the first candle is bearish followed by a long bullish candle which covers the bearish candle from both sides and lastly, the third candle opens above the high of the second candle and closes higher.\n\n",
      "text2": "The three outside up pattern is a reliable signal of a potential bullish reversal. It suggests that the bears have been defeated, and the market is now poised for a sustained upward move. This pattern is often seen at the bottom of a downtrend, signaling a potential change in market direction.\n\nAccording to a study by Cheol-Ho Park and Scott H. Irwin titled “The Profitability of Technical Analysis: A Review”, the three outside up pattern has a success rate of approximately 70% in predicting bullish reversals.",
      "text3": "The three outside up candlestick pattern is a variation of the chart candle reversal pattern that is used to indicate a trend reversal. The three outside up pattern forms at the downtrend and it takes three days for the pattern to form. The three outside up candlestick pattern comprises three consecutive candles forming the patterns most preferably at the end of the downtrend.\n\nThe first candle is red, a part of the prevailing downtrend. The next two are green candles that indicate a bullish reversal. Users need to have a basic understanding of how this pattern is formed to use the same. This article discusses the three outside up candlestick patterns in detail, its formation, trading, advantages, disadvantages, and more. \n\nThis triple candlestick pattern is an extension of the bullish reversal day pattern or the bullish engulfing pattern. This pattern is formed over three days of trading after a prolonged down string on the daily timeframe with the first two trading days looking like a bullish reversal or bullish engulfing day formation. The third candlestick completing the pattern is a bullish candlestick that approves the potential reversal. \n\nIn the above figure, we can see the schematic diagram of the three outside up patterns. We have three consecutive candlesticks here as mentioned above. \n\nThe three outside up candlestick patterns frequently occur and serve as a reliable indicator of a trend in reversal. Traders use it as a primary buying or selling signal. \n\nOne can observe that the first candle continues to show a bearish trend. The close of the first candle is lower than the open. This indicates a short-selling interest because it increases confidence in the market’s bearish moves. The second candle will be opening lower than the first. It will appear to be reversing the direction of the chart because of its long real body. It displays bull power as the candle crosses through the opening tick of the first candle. This action raises one red flag for any bears who wish to take their profits now and also tighten their stops because of the possibility of a reversal in the market. \n\nOne gets further confirmation that the market can experience a reversal in its trends, with the third candle. This happens due to the fact that the security shows gains with the price pretty well above the boundaries of the first candle. The third candle completes the bullish candlestick as described as an ‘outside day’. The trading day comes to a close after the trader observes all three candles. There is an increase in bullish confidence that sets off any buying signals. This is because the asset closes at a new high with the third candlestick. ",
      "image": "https://panthitech.github.io/ForexBuySellSignal/Images/Three%20Outside%20Up.png"
    },
    {
      "id": 8,
      "name": "Three Inside Up",
      "text1": "The three inside-up candlestick pattern is a bullish reversal pattern that has three candles. First candle is a bearish one. The small second candle is bullish. Marking the trend change, the third candle is a strong bullish one.",
      "text2": "The three inside-up patterns indicate a shift in market sentiment from bearish to bullish. The initial bearish candle shows the selling pressure, but the subsequent bullish or neutral second candle suggests that the bears are losing their grip on the market. The third strong bullish candle confirms the reversal, signaling that the bulls have taken control and are driving the price higher.\n\nAccording to a research paper titled “The Efficacy of Technical Analysis: A Statistical Review of Candlestick Patterns” by Andrew W. Lo, Harry Mamaysky, and Jiang Wang, published in The Journal of Finance, the success rate attributed of three inside up pattern  was approximately 64% in predicting bullish reversals.",
      "text3": "The three inside up candlestick pattern is an indication of trend reversal in the market. The three inside up patterns consist of three candlesticks that are formed in a specific way. The first candlestick will be a bearish candlestick that shows the prices have been dragged down. The two candlesticks that follow this bearish candlestick are bullish candlesticks that complete the formation of the three inside up candlestick pattern.\n\nThe three inside up candlestick pattern starts to form at the end of a downtrend. The three inside up candlestick pattern requires the individual candlestick to form a particular type of sequence. The sequence is an indicator to show that the current trend is weakening and a trend reversal is upcoming. The three candlestick pattern as the name suggests is made up of three candlesticks, one bearish candlestick and two bullish candlesticks. The first bearish candlestick is one with a large body with upper and lower wicks. The second candlestick is a bullish candlestick which is engulfed by the first bearish candlestick. The second candlestick denotes the change of the market movement from bearish to bullish. The third candlestick is a bullish candlestick that starts from or above the closing price of the second candlestick and moves upward. The third candlestick closes above the second and the first candlestick and indicates the completion of the trend reversal in the market from bearish to bullish. The pattern is considered as the three inside up only when the third candlestick opens halfway above the first bearish candlestick.\n\nThe trading strategy involved in the three inside up candlestick pattern is mainly based on right entry and exit in the market prices. The first step that should be taken by the traders is to wait and ensure that the pattern is completely formed and follows the trend reversal pattern. Once the three inside up pattern is formed the trader can buy security in a bulk and can sell them once it reaches new highs. The formation of the third candlestick in the three inside up pattern denies the exit of short sellers and allows new traders who wish to enter a long position to buy the security.\n\nThe second candlestick of the pattern indicates the slow emergence of the bulls. The second candlestick is a bullish candlestick. The candlestick is still engulfed by the initial candlestick and its high and low is engulfed by the bearish candlestick. The second candlestick denotes that the  buyers have taken up a resistance against the weak selling of the bears and started to gain control over the market. It is to note that the second candlestick only denotes the bulls have started the resistance and have not taken over the bears completely.\n\nThe third candlestick form is a bullish candlestick in the three inside up pattern. It is to note that the third candlestick must have its opening halfway above the body of the first bearish candlestick and the third candlestick must close above the upper wick of the initial bearish candlestick. When the third bullish candlestick satisfies this condition the pattern is considered as the three inside up pattern. \n\nWith the beginning of the third candlestick the bulls completely take over the market. With the end of the second candlestick the sellers have exited their short positions allowing the bulls to get long positions in the market . When the bulls sense that most of the sellers have exited the market more bulls gain confidence and start pushing the price up. The increased number of bulls makes the third candlestick open with a huge gap up. This is how the three inside up pattern emerges in the market.",
      "image": "https://panthitech.github.io/ForexBuySellSignal/Images/Three%20Inside%20Up.png"
    },
    {
      "id": 9,
      "name": "Bullish Kicker",
      "text1": "A bullish kicker is a candlestick pattern where a bearish candle is immediately followed by a strong bullish candle. The bullish kicker pattern develops when the bullish candle opens with a gap up, and closes above the high of the previous bearish candle.\n\n",
      "text2": "The bullish kicker pattern indicates a significant shift in market sentiment from bearish to bullish. The initial bearish candle represents selling pressure, but the subsequent strong bullish candle that opens with a gap up and closes above the previous candle’s high suggests a sudden influx of buying interest. \n\nAccording to a study conducted by the market research firm CXO Advisory Group, published in their analysis report titled “Technical Analysis of Stock Trends,” the bullish kicker pattern has a success rate of approximately 68% in predicting bullish reversals. ",
      "text3": "The bullish kicker is a trend-signalling candlestick pattern that appear after a bearish time period. A bullish kicker is usually followed by a period of growth. Investors use bullish kicker as an identifier for buy signals mainly to make the most of an expected market bull.\n\nThe bullish kicker is a part of ‘kicker’ candlestick patterns that are simple and single-edged. Kicker patterns are limited to showing only one trend. A bearish kicker indicates a bearish trend in contrast to a bullish kicker.\n\nThe bullish kicker candlestick pattern is widely used by traders along with other technical indicators to identify and trade in a bullish market. \n\nThe identification of the bullish candlestick pattern means an upcoming bullish trend. The Bullish Kicker Candlestick pattern is regarded as a strong bullish signal, indicating a sudden shift in market sentiment from bearish to bullish. The long candlestick indicates that there is strong selling pressure in the market, but the fact that it opens above the previous day’s closing price indicates that there is even stronger buying pressure, causing the price to rise sharply. See the image to understand how the pattern looks.\n\nA Bullish Kicker is formed when a long bearish candlestick is followed by an even longer bullish candlestick that opens above the previous day’s closing price. The long bullish candlestick indicates strong selling pressure in the market, but the fact that it opens above the previous day’s closing price suggests that the buying pressure is even stronger, which causes the price to rise sharply. This sudden shift in market sentiment from bearish to bullish is what makes the Bullish Kicker a strong bullish signal. Traders often use this pattern to identify potential buying opportunities.",
      "image": "https://panthitech.github.io/ForexBuySellSignal/Images/Bullish%20Kicker.png"
    },
    {
      "id": 10,
      "name": "Piercing Line",
      "text1": "The piercing line candlestick pattern is a bullish reversal pattern. A piercing line pattern is generated when a bullish candle that has opened below the low of the bearish candle closes above the midpoint of the previous candle.\n\n",
      "text2": "The piercing line pattern is a signal of a potential bullish reversal in the market. The initial bearish candle represents a period of selling pressure, but the subsequent bullish candle that opens below the previous candle’s low and closes above its midpoint indicates a strong resurgence of buying interest. This suggests that the bears have been unable to maintain their dominance, and the bulls are now taking control of the market.\n\nAccording to the study by the research team at the Technical Analysis of STOCK TRENDS (TAST) project, published in their comprehensive market analysis report, the piercing line pattern has a success rate of approximately 60% in predicting bullish reversals. ",
      "text3": "A piercing pattern is a two-day candlestick price pattern that includes a trading range of average or greater size on the first day, with the opening near the high and the closing near the low.  A piercing pattern indicates a potential short-term change from an upward trend to a downward trend.  It closely resembles a bullish engulfing pattern, which is a two-candle pattern and has a similar appearance. \n\nSteve Nison first defined the piercing candlestick pattern in his 1991 book, “Japanese Candlestick Charting Techniques.” The pattern is based on old-school Japanese candlestick charting methods from the 18th century.\n\nA piercing candlestick is a pattern used to spot possible price changes in the stock markets. A piercing candlestick consists of two candles, where the first candle is a long red/bearish candle, followed by a long green/bullish candle that opens below the previous day’s low. The green candle then closes above the midpoint of the previous day’s red candle, piercing it. The picture below depicts a piercing candlestick pattern.\n\nA falling asset forms a long bearish candle that is then followed by a shorter bullish candle that closes above 50% of the bearish candlestick that came before it, forming a piercing candlestick pattern. The majority of traders use a visual method to choose whether to buy or sell the asset. The diagram below demonstrates how this pattern emerges.\n\nThis pattern indicates that buyers have gained control after a period of selling and is considered a bullish signal. Traders often use the piercing candlestick pattern along with other technical indicators to make trading decisions. \n\nBullish signs typically include the bulls’ rejection of the gap down. Even more bullish sentiment is added by the fact that bulls were able to push further up into the losses from the previous day. Bulls were successful in maintaining higher prices by reducing excess supply and raising demand.  ",
      "image": "https://panthitech.github.io/ForexBuySellSignal/Images/Piercing%20Line.png"
    },
    {
      "id": 11,
      "name": "Hammer",
      "text1": "A hammer candlestick pattern is a single candlestick pattern that suggests a potential reversal of the overall bullish trend. A hammer is produced when a candle has a very short or no body and leaves a long, weak one on its lower side.\n\n",
      "text2": "The hammer pattern is formed when the market opens and trades lower, but then buyers step in and push the price back up, closing the candle near the high of the day. This long lower wick represents the failed attempt by the sellers to push the price lower, and the subsequent close near the high indicates that the buyers have regained control. This pattern suggests a potential shift in market sentiment from bearish to bullish.\n\nAccording to  “An Empirical Evaluation of the Performance of Technical Analysis” by Brett N. Steenbarger, published in the Journal of Futures Markets, the hammer candlestick pattern has a success rate of approximately 62% in predicting bullish reversals.",
      "text3": "The Hammer is a single candlestick pattern that forms during a downtrend and signals a potential trend reversal. It consists of a small real body that emerges after a significant drop in price. The candle has a long lower shadow that is at least twice the size of the real body. There is little or no upper shadow.\n\nFor a hammer to be valid, it must appear at the bottom of a downtrend. The long lower shadow indicates that the stock nose-dived at the open only to rebound significantly by the close. The slim real body signifies indecision as prices stabilized after the recovery. For confirmation, traders watch for increased volume on the hammer candle and look for follow-through buying pressure on the next candle.\n\nHammer candles signify buyers emerged to bid up prices from the lows. It implies selling pressure is weakening, and bulls are taking control. A single hammer isn’t always reliable, but back-to-back or multiple consecutive hammers strengthen the signal and indicate the decline could be ending. Traders would look to enter long positions on a close above the Hammer’s high with the expectation of an emerging uptrend. Proper candlestick pattern identification helps gauge shifts in supply and demand to spot potential trend change opportunities.\n\nThe Hammer Candlestick Pattern is a single candle formation that occurs in the candlestick charting of financial markets. The Hammer Candlestick Pattern is viewed as a potential reversal signal when it appears after a trend or during a downtrend. The pattern gets its name from the hammer-like shape of the candle body.\n\nThe hammer candle has a small real body at the top of a long lower shadow and little or no upper shadow. The long lower shadow indicates that the asset traded significantly lower than its opening price during the candle period but rallied to close near the open. This pattern shows that there was buying pressure during the period to push the price up from the low. \n\nThe ideal Hammer occurs after a downtrend and has a small real body at the top of the range showing indecision. It has little to no upper shadow, reflecting sustained buying pressure into the close. The lower shadow is long, at least twice the real body, showing intense prior selling. Increased volume adds validity. The long lower tail indicates the potential exhaustion of sellers.\n\nHammer candlestick patterns come in two forms – bullish and bearish. The bullish Hammer occurs during a downtrend and signals the potential exhaustion of selling momentum. It has a long lower shadow, reflecting sellers driving the price lower initially before buyers overtake and push the price back up to close near the open. This hints that upside potential is building. In contrast, the bearish hammer forms after an uptrend. It also has a long lower shadow, but in this case, it shows buyers pushed the price higher first before selling pressure took over to drive the price back down to close near the open. \n\nThe bearish Hammer sometimes hints that buying pressure is waning and the uptrend could be ending. The bullish hammer pattern hints at a potential reversal of a downtrend. Both hammers have long lower shadows, but the bullish version signals upside potential while the bearish hints at a peak. Identifying where they occur within the broader trend is key to interpreting the formation correctly.\n\nTraders will look for confirmation of the reversal on the candle following the Hammer. An upward white (or green) candle with a close above the hammer high indicates follow-through buying. This helps confirm the momentum has shifted to the upside. Sometimes, the reversal is confirmed with a gap opening up and a rally following the hammer candle.\n\nThe next candle should provide upside confirmation; otherwise, the Hammer could indicate a bearish reversal, commonly referred to as a shooting star. This shows lower prices were rejected, but the market is not ready to reverse the downtrend just yet. Additional bearish candles will confirm the downtrend is still intact.",
      "image": "https://panthitech.github.io/ForexBuySellSignal/Images/Hammer.png"
    },
    {
      "id": 12,
      "name": "Inverted Hammer",
      "text1": "The inverted hammer candlestick pattern is a single candle pattern that is typically formed following a downtrend. The inverted hammer is reminiscent of the hammer candlestick pattern, but with an upside-down appearance.",
      "text2": "The long upper shadow of the inverted hammer candlestick represents the bullish buying pressure that emerged during the session, pushing the price back up towards the opening level. This reversal signal suggests that the selling pressure may have been exhausted, and the market could be poised for a potential trend reversal or a bullish continuation.\n\nAccording to a study conducted by Corey Rosenbloom, CFA, in his research published on the website “Afraid to Trade,” the inverted hammer pattern has shown a success rate of approximately 65% in predicting bullish reversals. Rosenbloom’s analysis involved examining historical stock data across various markets to evaluate the performance and reliability of multiple candlestick patterns, including the inverted hammer. \n\nBearish Reversal Patterns: Bearish reversal patterns in candlestick charts indicate a potential shift from an uptrend to a downtrend, suggesting that sellers are starting to dominate the market. Examples include the Shooting Star, Bearish Engulfing, and Evening Star patterns, each defined by distinct formations that traders use to predict a possible market decline. Let’s learn 13 bearish reversal patterns. ",
      "text3": "The Inverted Hammer Candlestick Pattern is a chart pattern used in technical analysis to find  trend reversals. The Inverted Hammer Candlestick Pattern is formed on the chart when there is pressure from the bulls (buyers) to push the price of the asset higher. This pattern is typically observed at the end of the downtrend, and hence it signals a bullish reversal.\n\nThe Inverted Hammer Candlestick Pattern gets its name from its upside-down, hammer-like shape. The Inverted Hammer Pattern is identified with the help of its three main components: a long upper wick, a short lower wick, and a small body. The colour of the body is not significant, but it is generally white or green.\n\nThe Inverted Hammer Candlestick Pattern suggests a potential trend reversal from bearish to bullish. It directly indicates that bulls are starting to step in and are pushing the price up from the previous downtrend. The long upper shadow in the pattern signifies that the sellers had initially tried to push the price of the assets down but were ultimately defeated by the buyers.\n\nLet’s take an example of hypothetical company ABC’s share price, which is on a downtrend, last closing at ₹150.06. The shares of ABC opened at ₹150.91, with an intraday low of ₹150.52 with a high of ₹153.80 the next day. ABC’s share price closes at ₹151.38, creating an inverted hammer pattern as seen in the image below. The share price increases to ₹156.55 over the next two days, confirming the inverted hammer pattern, which ultimately confirms a bullish reversal.\n\nThe Inverted Hammer candlestick pattern is a bullish reversal chart pattern used for technical analysis that forms during a downtrend and signals a trend reversal. The Inverted Hammer pattern is characterised by a single candlestick with a small body and a long upper shadow (wick) that is at least twice the length of the body.\n\nThe Inverted Hammer candlestick pattern depicts a situation where the sellers were earlier pushing the price of the assets down, then a position of market uncertainty is created, after which the buyers ultimately push the price of the security up. The pattern resembles an upside-down hammer or an inverted letter “T.” The body represents the hammer’s handle, while the upper shadow acts as the head. \n\nThe Inverted Hammer candlestick pattern, just like all the other candlestick patterns, was invented in the Japanese rice trading markets during the 17th and 18th centuries. A very famous Japanese rice trader named Homma Munehisa developed the foundation of the Inverted Hammer candlestick pattern, which later gained popularity worldwide after the 19th century.\n\nHomma Munehisa observed that the price movements of assets were influenced by market emotions and public sentiments. Homma used the visual representation of candlesticks to depict the relationship between the opening, closing, high, and low prices for a given period, because of which trading patterns like the Inverted Hammer were developed.\n\nCandlestick charting techniques were further refined and expanded upon by other Japanese traders and analysts. Western traders and analysts in the 20th century began incorporating these techniques into their technical analysis methodologies.\n\nThe Inverted Hammer Pattern reflects a battle between buyers and sellers, with buyers showing strength in pushing the price higher despite initial selling pressure from sellers. The volume of the assets being traded increases significantly during the formation of this pattern.\n\nThe Inverted Hammer Candlestick Pattern is structured as a short body at the top of the price range and a long lower shadow, also referred to as the “tail.” There are four key elements to  the Inverted Hammer Candlestick Pattern structure.\n\nBody: The body represents the relative difference between the opening and closing prices of the trading period. The colour of the body, whether green or red, is not as important as its position and length.\nUpper Shadow (Wick): The size of the upper shadow plays a crucial role in the formation of the Inverted Hammer Candlestick pattern. The upper shadow is a vertical line that extends above the body. The size of the wick in most scenarios is twice the size of the body. The long wick indicates that the price of the asset has rallied significantly from the lows and suggests a strong rejection of lower prices.\nLower Shadow: An inverted hammer’s lower shadow is either nonexistent or extremely brief. It means that there hasn’t been much, if any, price decline during the trading time. The upper shadow’s importance in the pattern is emphasised by the lack of a lower shadow.\nSupport and Resistance Levels: The Inverted Hammer pattern is frequently examined in relation to price chart support and resistance levels. The pattern’s possible bullish connotations are strengthened by the fact that it formed close to a critical support level. It shows that buyers are active and trying to raise the price from a crucial support level.\nThe volume analysis also plays an integral role in confirming the structure of the Inverted Hammer Pattern. Traders usually watch for a rise in trading activity as the pattern develops. Rising volume hints at increased purchasing activity and supports the Inverted Hammer’s potential bullish reversal.",
      "image": "https://panthitech.github.io/ForexBuySellSignal/Images/Inverted%20Hammer.png"
    },
    {
      "id": 13,
      "name": "Bearish Engulfing",
      "text1": "A bearish engulfing pattern suggests that market control has lately been undertaken by sellers. Furthermore indicating that the number of sellers has exceeded the number of buyers is a bearish engulfing pattern. Seen on the top of the price chart, this candlestick pattern is thought of as the possible top of the market.",
      "text2": "The Bearish Engulfing pattern consists of two candles: the first is a smaller bullish candle, and the second is a larger bearish candle that completely engulfs the body of the first candle. This formation suggests a shift in momentum from buyers to sellers.\n\nAccording to a study conducted by the Technical Analysis Research & Education (TARE) Foundation, published in their report titled “Analyzing the Efficacy of Candlestick Patterns in Modern Markets,” the bearish engulfing pattern has a success rate of approximately 72% in predicting bearish reversals. ",
      "text3": "The Bearish Engulfing Candlestick is a technical chart pattern, which helps traders to analyse impending price declines. Bearish engulfing candlestick occurs in a price chart when a small(white/green) bullish candlestick is followed by a large(red/black) bearish candlestick that completely engulfs the previous candlestick. Bearish Engulfing Candlestick pattern is important as it helps traders to identify the situation where sellers have surpassed buyers, such situations cause a lowering of the price (down candle) more than what buyers could do (up candle).\n\nThe bearish engulfing candlestick pattern is used by traders as a signal to enter a short position or to exit a long position. Traders also use additional fundamental research and technical analysis tools, such as trend lines, support and resistance levels, or moving averages, Relative Strenght index etc. to validate the signal by the candlesticks and choose their entry and exit points for the trade.\n\nA bearish engulfing candlestick is a technical chart pattern that occurs when a small bullish candlestick is followed by a larger bearish candlestick that completely engulfs the previous candlestick, including its shadows, signaling a trend reversal. A bearish engulfing candlestick pattern indicates that the bears have taken control of the market and are likely to drive prices of the stock lower. It is frequently interpreted as a sign that the current trend will reverse. Bearish Engulfing Candlestick Pattern occurs during an uptrend.\n\nThe bearish engulfing pattern is important because it shows sellers of a particular stock have overtaken the buyers of the same stock and are pushing the price more aggressively down (black/red candle), than the buyers were able to push it up (white/green candle)\n\nA bearish engulfing candlestick can be identified by its six distinct signals and characteristics, which include: \n\nFormation: The bearish engulfing pattern is formed by two candlesticks, with the first bullish stick being a smaller (white/green) bullish candlestick and the second (black/red) candlestick being a larger candlestick. The larger bearish candlestick completely engulfs the previous bullish candlestick, including its shadows.\nColour: The first candlestick in the pattern is usually green or white, indicating bullishness, while the second candlestick is red or black, indicating bearishness.\nSize: The second bearish candlestick is typically larger than the previous bullish candlestick, indicating that the bears (sellers) have taken control of the market, indicating a decline in the value of the stock.\nTrend: The pattern usually appears during an uptrend, which means that the prices of the stock are going to fall and signals a potential reversal of the trend.\nVolume: The pattern is typically accompanied by high trading volume, which indicates a strong conviction from traders.\nConfirmation: Traders often look for confirmation of the pattern through additional technical analysis tools, such as trend lines, support and resistance levels, or moving averages, RSI etc.\nThe bearish engulfing candlestick is a pattern, which is a bearish reversal signal that suggests a potential shift in the trend and it helps market participants to discover new opportunities.",
      "image": "https://panthitech.github.io/ForexBuySellSignal/Images/Bearish%20Engulfing.png"
    },
    {
      "id": 14,
      "name": "Bearish Harami",
      "text1": "A bearish harami pattern is a two-candle pattern. A bearish harami pattern results from a small body (Red) candle developing after a larger body (Green). Usually showing a possible bearish trend reversal, this pattern appears at the top of the price chart.",
      "text2": "The bearish harami pattern is a strong bearish signal that suggests the market may be near a top or a significant high. The large bullish candlestick represents the buying pressure in the market, while the smaller bearish candlestick that follows shows the bears gaining control and driving prices lower. To bearish harami, one compares the bearish engulfing pattern, as both suggest the market may be near a top or a significant high.\n\nAccording to a study titled “The Effectiveness of Candlestick Patterns in Financial Markets” conducted by Professor Wing-Keung Wong and his team at the Department of Economics, Hong Kong Baptist University, the bearish harami pattern has a success rate of approximately 63% in predicting bearish reversals. ",
      "text3": "A bearish harami is a two bar Japanese  candlestick reversal pattern. A bearish harami candlestick pattern indicates a potential trend reversal from bullish to bearish. This pattern is generally formed at the top of the price chart. A bearish harami candlestick pattern includes 2 candles – A long-bodied green candle and a short red candle.\n\nA bearish harami pattern is confirmed when both the high and low of the short red candle are engulfed by the preceding long green candle.\n\nThe image above shows an example of the bearish harami candlestick pattern. The highlighted part in the image shows the formation of the candlestick pattern. Remember, the shorter the red candle, the higher the chances of a potential reversal in the market.\n\nThe bearish harami pattern indicates that the buyers are losing their influence over the market and the sellers can potentially take over. Traders often confirm this pattern by using other technical tools.\n\nBearish harami is a double candle pattern used in technical analysis. Bearish harami generally forms towards the end of a bullish rally and signals a potential reversal to the downside. This pattern is formed when the buyers are exhausted and the sellers are about to outnumber the buyers.\n\nTraders usually prefer to book their long positions or build a new short position after seeing this pattern forming. The bearish harami pattern is not very effective by itself. This is why traders use additional technical tools like RSI (Relative Strength Index) and MACD (Moving Average Convergence Divergence) for further confirmation. \n\nThe word “Harami” means pregnant in Japanese. The harami candlestick pattern gets its name from the visual structure of the pattern. The short red candle is formed right within the long bodied green candle. Visually, this candle structure looks pregnant. This is why this pattern is called pregnant or “Harami”.\n\nIn the above picture, you can see a bearish harami right at the top of the chart after a bullish rally in the stock. Notice how the price has dropped significantly after the formation of the bearish harami pattern. Clear bearish is seen in the price after the formation of the bearish harami candlestick pattern.\n\nNotice how a long green candle is preceding the short red candle. Most traders prefer taking a short trade or exiting their existing bullish position after the bearish harami candlestick pattern gets confirmed. \n\nThere are two major differences between the bullish and bearish harami candlestick pattern – \n\n 1) The bullish harami pattern is formed at the bottom of the chart. The bearish harami pattern is formed at the top of the price chart.\n\n2) The bullish harami pattern indicates a potential reversal in the trend from bearish to bullish market. The bearish harami pattern indicates a potential reversal in the trend from bullish to bearish market.",
      "image": "https://panthitech.github.io/ForexBuySellSignal/Images/Bearish%20Harami.png"
    },
    {
      "id": 15,
      "name": "Tweezer Top",
      "text1": "The Tweezer top candlestick pattern is a bearish reversal pattern. Tweezer top pattern occurs when there are two or more candles having identical highs that mark a horizontal line of resistance.",
      "text2": "Typically, the first candlestick is bullish, indicating a continuation of the uptrend, while the second candlestick is bearish, signalling a potential reversal as it fails to surpass the high of the previous candlestick and closes lower.\n\nAccording to a study conducted by the Financial Markets Research Centre at Vanderbilt University, published in their report titled “Candlestick Patterns and Their Statistical Significance in Financial Markets,” the Tweezer Top pattern has a success rate of approximately 61% in predicting bearish reversals.",
      "text3": "Tweezer candlestick patterns are a pair of candlestick trend reversal patterns. Tweezer tops indicate a bearish reversal, whereas tweezer bottoms indicate a bullish reversal. When two candlesticks’ highs after an uptrend are nearly identical, tweezer top candlestick patterns develop.\n\nThe tweezer top pattern is like a warning sign for investors. It shows up when there are two candles in a row. The first candle is like a cheerleader, it’s green, which means the price went up.\n\nThen there is a red candle, which means the price dropped. What’s interesting is that both of these candles have their highest point at the same level, or close. It’s like a double-check that the price is stuck at a certain point.\n\nThe tweezer top is like a red flag in the stock market. It happens when two candles stand side by side, their tops at the same level. This means the price tried hard to go higher but just couldn’t. It’s like reaching a ceiling – there’s no going further up.\n\nThis pattern suggests the market might be about to change direction, at least for a bit. It’s a heads-up for potential downturns.",
      "image": "https://panthitech.github.io/ForexBuySellSignal/Images/Tweezer%20Top.png"
    },
    {
      "id": 16,
      "name": "Evening Star",
      "text1": "An evening star candlestick pattern is a bearish reversal pattern. Evening star pattern consists of three candles. The first candle is a robustly positive one. The second candle is a doji, which indicates both buyer weakness and the indecision of the market players. A strong bearish candle that marks the trend change is the third one.\n\n",
      "text2": "The strong bullish candle at the beginning represents the buying pressure in the market, while the doji candle that follows indicates indecision and a weakening of the buying pressure. The final strong bearish candle then confirms the bearish reversal, signaling that the sellers have taken control of the market.\n\nAccording to a study published in the “Journal of Technical Analysis” by David Aronson and Timothy Masters, titled “Evaluating the Performance of Candlestick Patterns in Financial Markets,” the Evening Star pattern has a success rate of approximately 69% in predicting bearish reversals. ",
      "text3": "The Evening Star pattern is a candlestick pattern that appears at the top of the uptrend and predicts that a downtrend is approaching. An Evening Star is a bearish reversal candlestick pattern comprising three candles: one big bullish candlestick, one small-bodied candle, and one bearish candle.\n\nThe evening star is a reliable sign that a downward trend has started. The pattern usually forms over three days. The huge white candle indicating a steady price increase will be visible on the first day; it will be followed by a smaller candle indicating a noticeably slower rise in prices. The third day will have a large red candle with an opening price that is lower than the second day and then ends near the middle of the first day.\n\nTraders trade this pattern by selling or shorting the asset after the formation of the bearish candle, with a stop loss placed above the pattern high. Profit targets are established either at the closest support level or at a previous low.\n\nThe psychology behind the pattern is that the market sentiment at the moment is bullish, and the prices continue to hit higher highs. This bullish attitude persists until the first candle of the evening star forms. The market experiences another bullish day when the second candle forms as it gaps up. Traders anticipate profit-taking because the market has risen significantly and has been rising for a while. This results at the beginning of the selling pressure, which makes it more difficult for the bulls to continue driving the prices upward. The market closes roughly where it opened, thus producing a Doji or a spinning top candlestick pattern. The appearance of the bearish candle on the third candle demonstrates that the bears have taken control of the prices. The market gaps are down, and more people expect a trend reversal.\n\nThe second candle is the “star” with a little body. This candle is either bullish or bearish or without a body( neutral). The asset price closes at a level that is extremely near to the open price with balanced buying and selling orders, according to the star feature. The star indicates a slowdown in the earlier bullish momentum. An ideal Evening Star pattern has a gap up from the first candle to the star. This indicates that there were few or no transactions between the previous close price and the open price, which caused the open price to rise quickly. \n\nThe third candle is generally bearish, with the close price lower than the open price and a gap down from the previous star. The first candle’s upward trend has been reversed, eliminating the price increase. This candle provides a selling signal and verifies the Evening Star pattern, ideally with a gap down.",
      "image": "https://panthitech.github.io/ForexBuySellSignal/Images/Evening%20Star.png"
    },
    {
      "id": 17,
      "name": "Evening Star Doji",
      "text1": "An evening star doji candlestick pattern is a bearish reversal pattern. Evening star doji is made up of three candles. The first candle is a strong bullish candle which resumes the bullish trend. The second candle is a doji which represents the indecision of the market participants and also shows that the buying pressure has slowed down. The third candle is a strong bearish candle which marks the trend change from bullish to bearish.\n\n",
      "text2": "The evening star doji pattern forms when the market sentiment shifts from bullish to bearish. The initial strong bullish candle represents the buying pressure in the market, but the doji candle that follows indicates indecision and a slowdown in the buying pressure. The final strong bearish candle then confirms the reversal, as the sellers take control of the market.\n\nAccording to a research paper titled “The Predictive Power of Candlestick Patterns” by Dr. Mitchell A. Petersen, published in the Review of Financial Studies, the Evening Star Doji pattern has a success rate of approximately 68% in predicting bearish reversals. This study involved a detailed analysis of various candlestick patterns, including the Evening Star Doji, across a broad dataset of historical stock prices. ",
      "text3": "Evening Star Doji is a three-candle pattern that signals a potential reversal in an uptrend.  Evening star doji candles generally indicate a lack of consensus among traders regarding the direction of the price.  The evening Doji Star pattern is not a frequent pattern. A doji candle (red colour) with a body placed below a trendline confirms an evening doji star in most charts.\n\nThis pattern provides traders with a clear indicator of when to sell or short a stock, which is one of its advantages. Following an upswing, the pattern suggests that bears are gaining pace; therefore, it would be prudent to sell before the price declines further. One drawback of employing the Evening Star Doji is that its accuracy is not always reliable. Investigating additional technical indicators and market movements is essential to validate the pattern.\n\nThe evening star doji is a bearish reversal pattern made of up three candles: a red candle, a small-bodied candle, and a large green candlestick. It is formed when a green candlestick is followed by a Doji, which is then followed by a red candlestick. An evening star doji is similar to an evening star candlestick pattern. ​​The Evening Doji Star must be a Doji candle for the second candle, which is the only distinction. Let us look at an example to understand this better.\n\nThere are three candles to be taken note of in the above image. The first is a green candle, the second is a small candled and red doji and the third is a large red candle. This causes the formation of an evening star doji. The Doji represents indecision in the market, and the red candlestick indicates that the bears have taken control.\n\nA red doji is a candlestick with a small body that appears in the centre of the evening star doji pattern, between a long bullish candle and a long bearish candle. A red doji shows a bearish trend. The doji is a symbol of indecision in the market and shows that bulls are losing momentum while bears may be gaining power. This is suggested by the fact that the bulls are losing momentum.\n\nThe pattern begins with a long bullish candle, which is then followed by a small-bodied doji candle that gaps up from the preceding candle, signalling indecision in the market. The pattern ends with a long bullish candle.\n\nA long bearish candle that spans down from the doji at the end of the pattern is a clear indication that bears have gained control of the market. The appearance of a red doji is a warning sign that the bulls are losing steam and that the bears are gaining power. This may be a hint that the current upswing is about to come to an end and that a trend reversal is on the horizon.",
      "image": "https://panthitech.github.io/ForexBuySellSignal/Images/Evening%20Star%20Doji.png"
    },
    {
      "id": 18,
      "name": "Bearish Abandoned Baby",
      "text1": "A bearish abandoned baby is a pattern that suggests bearish reversal. The first candle is strongly bullish. The second one opens following a gap and is a doji. Strong bearish candle that gaps down and indicates a trend change is the third candle.\n\n",
      "text2": "The bearish abandoned baby pattern forms when the market sentiment shifts from bullish to bearish. The initial strongly bullish candle represents the buying pressure in the market, but the doji candle that follows indicates indecision and a weakening of the buying pressure. The final strong bearish candle that gaps down then confirms the reversal, as the sellers take control of the market.\n\nAccording to a study titled “The Effectiveness of Technical Analysis: An Empirical Study of Candlestick Patterns” by Professors Lu Zheng and Wenjun Xie, published in the Journal of Empirical Finance, the Bearish Abandoned Baby pattern has a success rate of approximately 78% in predicting bearish reversals.",
      "text3": "Bearish Abandoned Baby is a type of candlestick pattern consisting of three candles, one with rising prices, a second with holding prices, and a third with falling prices. A Bearish Abandoned Baby is a rare pattern that has a reasonably strong track record for forecasting a short term downward trend. The first candlestick is a large bullish candle that is followed by a Doji candle that gaps up.\n\nThe key item of the bearish abandoned baby is the middle day, which should have a gap in front of it and which closes the session with price unchanged. The bearish abandoned baby pattern indicates reversal to the downtrend and is used by the traders to exit a buy position and enter a short position. Traders expect that the price will continue to move down and bears are back into action after the formation of this pattern.  The doji candle becomes a significant signal for traders and technical analysts attempting to identify a bearish reversal of a bullish trend in this pattern.\n\nTraders who observe this pattern interpret it as a bearish signal and consider taking short positions in the market. The bearish abandoned baby pattern gets its name from the fact that the Doji candlestick is “abandoned’’ between the two large bullish and bearish candlesticks, which are like the “parents’’ of the doji.The pattern suggests that the buying pressure from the first candlestick was followed by a period of indecision and then selling pressure, resulting in a bearish reversal. \n\nThe bearish abandoned baby pattern have some advantages including, giving early warning signs that a bullish trend will come to an end, providing confirmation that a trend reversal is taking place, giving potential profit opportunity to the traders, and the traders can manage their risk more effectively. There are also disadvantages to consider even though the bearish abandoned baby pattern is very useful.\n\nLimited timeframes and emotional biases are the main two disadvantages of bearish abandoned baby patterns. The pattern is also not 100% accurate at times when the pattern appears but the trend does not actually reverse. This will lead to false signals and losses for traders. The bearish abandoned baby pattern is open to subjective interpretation.\n\nThe bearish abandoned baby candlestick pattern is a three candlestick pattern that appears on a chart and is considered as a bearish reverse signal. The first candle is a long white candlestick which represents a bullish market trend. The second candle is a doji which indicates indecision in the market. The third candle is a long black candlestick which represents a bearish market trend. ",
      "image": "https://panthitech.github.io/ForexBuySellSignal/Images/Bearish%20Abandoned%20Baby.png"
    },
    {
      "id": 19,
      "name": "Three Outside Down",
      "text1": "The three-outside-down candlestick pattern is a bearish reversal pattern. The first candle is bullish. The second candle is a bearish candle that completely overwhelms the previous bullish candle. The third candle closes below the low of the second candle.",
      "text2": "The three-outside-down pattern is formed when the market is in an uptrend, and then suddenly reverses direction due to increased selling pressure. The first bullish candle represents the continuation of the uptrend, but the second and third candles indicate that the bulls have lost control of the market, and the bears have taken over, leading to a potential reversal.\n\nAccording to a study conducted by the Department of Finance at the University of Illinois, published in their research paper titled “Candlestick Patterns and Market Reversals: Empirical Evidence,” the Three-Outside-Down pattern has a success rate of approximately 67% in predicting bearish reversals. ",
      "text3": "The Three Outside Down is a three-candle trend reversal pattern that appears on the candlestick chart after a bullish rally. Three Outside Down is formed by three candles formed consecutively indicating that the current upward trend has lost momentum and a trend reversal can occur. The Three Outside Down candlestick pattern is formed at the peak of an uptrend and indicates a bearish reversal. Traders use this pattern for finding potential opportunities to sell assets as it indicates a sudden upcoming downfall in the price of assets. \n\nThe Three Outside Down pattern is formed when the first candle is a long bullish candle, followed by a smaller bearish or bullish candle that opens higher but closes lower than the previous candle. The third candle is a long bearish candle that closes below the midpoint of the first candle.\n\nThe Three Outside Down pattern suggests that the buyers, who were in control of the market have lost their momentum and the sellers have taken over. Traders can use this signal to sell their positions or enter a short position in the market.\n\nThe Three Outside Down patterns occur frequently and are reliable indicators of a reversal. It is also easy to spot on a candlestick chart making it accessible to both novice and experienced traders. \n\nThe Three Outside Down pattern is not always accurate and should not be relied on solely. The pattern can also be subjective as different traders can interpret the formation differently. Traders should always use other technical analysis tools and fundamental analysis to confirm their trading decisions. The Three Outside Down pattern can not be as effective in markets with low volatility or during periods of economic uncertainty.\n\nThe three-outside down pattern is a triple candlestick patterns and typically follows a negative trend. These candles always show whether or not a trend reversal is about to occur.\n\nThe first candle is a green bullish candlestick that typically closes near the high of the day, this candle indicates the dominance of the bulls in the market. The green candle represents the current uptrend in the market. The second candle is a red bearish candlestick that opens above the previous day’s high and closes below the previous day’s low.\n\nThe second candle completely engulfs the first bullish candle and acts as a turning point in the current trend of the market. This candle Indicates that the market is now being controlled by the bears and they are pushing the price down. The three outside down pattern is formed at the top of an uptrend as shown in the chart below.\n\nThe next candle of this pattern is formed when the bulls have lost momentum and the bears have taken control of the market. The second candle is a large black/red candlestick that completely engulfs the first candlestick. \n\nThe third candle must also be black/red because it represents the final candle of three outside down. This candle should finish higher than the second candle. This demonstrates how the uptrend tendency of a particular asset is shifting.\n\nThe below image shows the formation of the Three Outside Down candlestick pattern, this pattern is formed when the above-mentioned three candlesticks appear on the chart consecutively. \n\nThe first candle signifies the end of the prevailing bullish trend as the second bearish candle completely engulfs it. The third candlestick marks the beginning of a new bearish trend. \n\nThe three outside down pattern is a reliable sign of a reversal because it has a higher success rate when compared with other indicators. This pattern can be used by traders for their main purchasing or selling signals, but they should still keep an eye out for additional chart patterns or technical confirmations. ",
      "image": "https://panthitech.github.io/ForexBuySellSignal/Images/Three%20Outside%20Down.png"
    },
    {
      "id": 20,
      "name": "Three Inside Down",
      "text1": "The three inside down candlestick pattern is a bearish reversal pattern which is formed at the top of the price chart. Three inside down patterns are formed when the first candle is bullish followed by a long bearish candle that covers the bullish candle from both sides and lastly, the third candle which breaks and closes below the 2nd candle’s low.",
      "text2": "The three inside down pattern indicates a potential shift in market sentiment from bullish to bearish. The first bullish candle represents the continuation of the uptrend, but the subsequent bearish candles suggest that the buyers are losing control, and the sellers are gaining momentum. This pattern signals that the market may be due for a bearish reversal.\n\nAccording to a study published in the “Journal of Technical Analysis” by Dr. Charles M. Cottle and his research team, titled “The Predictive Power of Candlestick Patterns in Financial Markets,” the Three Inside Down pattern has a success rate of approximately 64% in predicting bearish reversals. ",
      "text3": "A three inside down pattern is a price chart candlestick formation that signals a bearish trend reversal. A three inside down pattern comprises three candlesticks including a long bullish candlestick, a smaller bearish candlestick contained within the first candlestick and a third bearish candlestick that closes below the second candlestick. The three inside down candlestick pattern forms at the end of an uptrend, indicating a shift to a downward bearish trend. The formation of the three inside down candlestick pattern is the result of the buyers or bulls losing the dominating position they had held to the sellers or bears.  \n\nThe three inside down candlestick pattern is considered a bearish harami pattern that is followed by a confirmation candlestick. The first two candlesticks of the pattern are essentially a bearish harami pattern. They resemble the figure of a woman carrying a child in her womb, as suggested by the Japanese word ‘harami’ meaning ‘pregnant’. The third candlestick of the pattern is nothing but a confirmation candlestick, that confirms the bearish trend reversal. The best time to trade using the three inside down candlestick pattern is after the appearance of the third candlestick of the pattern. Investors and traders tend to take up short positions at the end of the day when the third confirmation candlestick appears. \n\nThe two main advantages of the three inside-down candlestick patterns include their ability to be spotted easily and their suitability for short-term and intraday trading. Three inside down candlestick patterns are however very commonly found and hence not always reliable. The two main disadvantages of the pattern include its tendency to signal reversals which are small or insignificant and its tendency to produce false signals. The three inside down pattern must ideally be used along with other technical indicators to produce reliable results. \n\nThe image indicates that the three inside down candlestick comprises a long bullish candlestick, a second small-bodied-bearish candlestick with its open and close price contained within the body of the first candlestick and a long bearish candlestick closing below the close of the second candlestick.\n\nThe three inside down candlestick pattern is a triple candlestick pattern and occurs at the end of a bullish uptrend and it tells the traders that the bullish trend is coming to an end. The three inside down pattern indicates that the bears are starting to gain dominance over the bears in the market. Traders alter their trading strategies upon seeing the three inside down patterns and resort to trading strategies such as shorting to gain maximum advantage from the upcoming bearish trend reversal. ",
      "image": "https://panthitech.github.io/ForexBuySellSignal/Images/Three%20Inside%20Down.png"
    },
    {
      "id": 21,
      "name": "Hanging Man",
      "text1": "The hanging man candlestick pattern is a bearish trend reversal pattern. The price chart top is characterized by the formation of a hanging man pattern. The candle’s lower side is characterised by a lengthy wick, while the upper side has minimal to no wick.",
      "text2": "The hanging man pattern forms when the market is in an uptrend, and a single candlestick with a long lower wick appears. The candle opens and the price starts to decline. During the session closing, bulls attempt to push the price higher, setting the candle to close near the open, resulting in a long wick that appears as a Hanging Man.\n\nThe hanging man pattern is considered a bearish reversal signal because it suggests that the market is losing momentum and the buyers are losing their grip on the price. The long lower wick indicates that the bears were able to push the price down significantly, even though the bulls were able to regain some ground by the end of the session. \n\nAccording to a study conducted by the Financial Markets Research Center at Vanderbilt University, published in their report titled “Candlestick Patterns and Their Statistical Significance in Financial Markets,” the Hanging Man pattern has a success rate of approximately 59% in predicting bearish reversals. ",
      "text3": "The hanging man candlestick pattern is used when the market is bullish to identify signs of the market turning bearish.The hanging man is a bearish candlestick pattern that indicates a trend reversal. Each individual candlestick is constructed from four data points. The open, close, high, and low are them. These informational pieces help the knowledgeable trader understand the current state of the market.  \n\nThe hanging man pattern is formed when the price opens higher than the previous day’s close but then drops significantly during the day, closing near or below the opening price. The pattern looks like a hanging man, hence the name. \n\nA hanging man structure appearing after an uptrend is a reliable signal that the market trend may be about to reverse in the near future. Traders can use this information to help them make informed decisions about their investments and possibly avoid losses as a result.\n\nA Hanging Man candlestick is a technical analysis bearish reversal pattern that indicates a potential trend reversal from an uptrend to a downtrend. It forms at the top of an uptrend and has a small real body, a long lower shadow, and little to no upper shadow. The long lower shadow indicates that the price dropped significantly during the day but recovered and closed near the opening price, forming a small real body resembling a hanging man. Below is a picture of the the pattern formation.\n\nThe Hanging Man has a long lower shadow, a small real body, and little or no upper shadow to characterise the pattern. The small real body, which is usually found at the top of the candlestick, can be bullish or bearish. Traders looking for the Hanging Man pattern should look for a candlestick with certain characteristics.\n\nThe candlestick should have a long lower shadow that is at least twice as long as the actual body. The upper shadow should be minimal or non-existent, indicating that the price did not trade higher than the real body. The real body should be small, indicating that price movement was minimal during the trading session. The real body of the candlestick should be at the top, indicating that the bulls were unable to push the price higher. ",
      "image": "https://panthitech.github.io/ForexBuySellSignal/Images/Hanging%20Man.png"
    },
    {
      "id": 22,
      "name": "Bearish Kicker",
      "text1": "The bearish kicker pattern is a candlestick pattern where a bullish candle is quickly followed by a strong bearish candle. The bearish kicker pattern forms when the bearish candle opens gaps down, breaks and closes below the previous bullish candle’s low.\n\n",
      "text2": "The bearish kicker pattern is formed when the market experiences a sudden and significant shift in sentiment from bullish to bearish. The initial bullish candle in the bearish kicker pattern reflects the continuation of the uptrend, but the subsequent bearish candle that gaps down and closes below the previous low indicates a strong rejection of the bullish sentiment by the bears. This pattern suggests a potential reversal of the uptrend.\n\nAccording to a study published in the “Journal of Behavioral Finance” by Dr. Andrew Lo and his research team, titled “Empirical Evaluation of Technical Trading Strategies,” the Bearish Kicker pattern has a success rate of approximately 70% in predicting bearish reversals.",
      "text3": "The bearish Kicker Pattern is a two-bar candlestick pattern that indicates a significant shift in the direction of an asset’s price trend, reflecting a group of market participants taking control. The bearish kicker is an arrangement in financial modeling that are recognised by a sharp decline in price over the course of its distinctive two-bar candlestick formation. Traders use it to ascertain which market segment is in charge of the direction. \n\nThe bearish kicker pattern has been around since the early days of Japanese candlestick charting, which was first brought to the Western world in the 1990s.  The pattern was dubbed the “abandoned baby” pattern when it was first released, but it was rebranded as the “bearish kicker” pattern in later releases.\n\nThe primary benefit of the bearish kicker is that it offers a clear indication of a change in the direction in which the price trend is moving in. Traders who are interested in shorting the market or getting out of long positions before the price drops even further find this information helpful.\n\nA bearish kicker is a candlestick pattern that consists of two candles that occur during a price uptrend. A bearish kicker pattern is recognised by the sudden and dramatic reversal in price that occurs during the distinct two-bar candlestick formation that it possesses. Traders frequently rely on the bearish kicker pattern as an indicator of a bearish trend, which enables them to make educated decisions regarding the purchase or sale of assets. \n\nThe pattern occurs when a long white or green candlestick is followed by a gap up and a second black or red candlestick that opens above the previous day’s high but then closes below the previous day’s low. The second candlestick completely engulfs the first one, forming a bearish engulfing pattern.\n\nThe bearish kicker pattern’s significance is magnified when it occurs in overbought or oversold areas. It indicates that the market has reached an extreme and a reversal may be imminent. It suggests that the market participants have taken control, and a strong upward move is likely to follow when a bullish kicker pattern appears in such market conditions, Traders often use this pattern as a confirmation signal to enter long positions, anticipating a further bullish move in the asset’s price.\n\nThe bearish kicker candlestick pattern creates a better risk-to-reward ratio than when it shows a reversal on a chart near high prices. This is because the bearish kicker candlestick pattern does not have to form after a large downtrend or uptrend in price. No matter whether the current chart is moving upwards, downwards, or sideways, the presence of this signal should be interpreted as bearish.  \n\nLet us look at an example. Suppose the stock price of Tata Motors has been moving sideways or even slightly upwards for some time. A sudden bearish kicker candlestick pattern could emerge, indicating that the bears have taken control of the market and a sharp downtrend may follow. This pattern’s appearance could provide traders with an opportunity to enter short positions and potentially profit from a downside move in the stock price.",
      "image": "https://panthitech.github.io/ForexBuySellSignal/Images/Bearish%20Kicker.png"
    },
    {
      "id": 23,
      "name": "Dark Cloud Cover",
      "text1": "The dark cloud cover candlestick pattern is a bearish trend reversal pattern. A dark cloud cover pattern is formed when a bullish candlestick is followed by a bearish candle that has opened above the bullish candle’s high but ultimately closes below the midpoint of its previous candle.",
      "text2": "The initial bullish candle represents the continuation of the uptrend, but the subsequent bearish candle that opens above the previous high and closes below the midpoint of the bullish candle suggests a strong rejection of the bullish momentum by the bears. This pattern indicates a potential reversal of the uptrend.\n\nAccording to a study conducted by the Technical Analysis Research & Education (TARE) Foundation, published in their report titled “Evaluating the Effectiveness of Candlestick Patterns in Modern Markets,” the Dark Cloud Cover pattern has a success rate of approximately 65% in predicting bearish reversals. ",
      "text3": "The dark cloud cover is a candlestick pattern that signals a momentum shift to bearish. The dark cloud cover appears mostly after a prolonged uptrend indicating a trend reversal to a downtrend. They show a particular security’s opening, closing, and high, and low prices over time.  \n\nThe black cloud cover candlestick has the primary advantage of providing traders with an early indication to abandon long holdings or enter short positions, allowing them to capitalize on possible price decreases. One significant disadvantage of the dark cloud cover candlestick is that it can occasionally produce false signals, causing traders to make poor trading decisions.\n\nThe dark cloud cover occurs when a lengthy bullish candle is followed by a long bearish candle with closing below the previous candle’s midpoint. This pattern indicates that buyers were unable to maintain market power and that sellers have taken over, potentially resulting in a downward trend. This pattern is frequently used by traders as a signal to sell or enter short positions.\n\nThe Dark Cloud Cover candlestick pattern is a two-candle bearish reversal pattern that occurs at the end of a prolonged uptrend. The first candle is a lengthy bullish candle, showing that the market was in the hands of buyers. The second candle is a lengthy bearish candle that opens above the preceding candle’s high but closes below the previous candle’s middle, signaling that sellers have taken control of the market. Below is a pictorial representation of the candle.\n\nThe pattern consists of a lengthy bullish candle followed by a long bearish candle that opens above the previous candle’s high. The green candle is bullish and the red one is bearish in the above image. The second candle, however, closes below the previous candle’s midpoint, indicating a shift in market sentiment from optimistic to negative. This is the most important point that distinguishes dark cover candlestick from just two long bullish and bearish patterns appearing back to back. This pattern is frequently seen as a warning indication that the market is about to reverse from an uptrend to a decline but it sometimes occurs in non-trendy markets too. The applicability of trade signals in such situations is often thin.\n\nThe Dark Cloud Cover candlestick pattern is significant because it can provide traders with an early tip to abandon long positions or enter short positions. The pattern indicates that buyers were unable to maintain market power and that sellers have taken over. This pattern can be used as a signal for traders to sell or enter short positions, perhaps capitalizing on a downward trend.",
      "image": "https://panthitech.github.io/ForexBuySellSignal/Images/Dark%20Cloud%20Cover.png"
    },
    {
      "id": 24,
      "name": "Shooting Star",
      "text1": "The shooting star candlestick pattern is a single candlestick bearish reversal pattern. Shooting star is formed with a single candle which has a long wick at the top and a small or no body. The shooting star pattern is confirmed after a strong bearish candle follows the shooting star candle.\n\n",
      "text2": "The shooting star pattern is formed when the market experiences a sudden rejection of the bullish momentum. The long upper wick of the shooting star indicates that the buyers attempted to push the price higher, but the sellers were able to push the price back down, creating the long upper wick. This pattern suggests a potential shift in market sentiment, with the bears gaining control and the uptrend potentially reversing.\n\nAccording to a study published in the “Journal of Technical Analysis” by Dr. Thomas Bulkowski, a renowned expert in chart patterns, titled “The Performance of Candlestick Patterns in Financial Markets,” the Shooting Star pattern has a success rate of approximately 59% in predicting bearish reversals.",
      "text3": "A shooting star candlestick is a type of price chart pattern that is created when a security’s price increases initially after opening and then falls close to the opening price before the market closes. A shooting star candlestick is structured by a small body, a long upper shadow or wick indicating the increase in price and buying pressure and a short lower shadow or wick indicating the price drop. Shooting star candlesticks signify the start of a bearish market trend where the prices start to decline. Bearish trend reversals are, however, confirmed after analyzing the two or three consecutive candlestick patterns that follow a shooting star, to ensure maximum certainty. \n\nShooting star candlestick patterns are used in technical analysis by traders to predict upcoming bearish trends. The decline in the price is considered a signal that the sellers have taken over the market. To trade with shooting stars, investors need to focus on three main points including finding the entry point, using stop-loss and deciding on the target profit.  Traders commonly wait for the consecutive candlestick pattern when they spot a shooting star pattern to confirm the price declines. They consider options such as selling or shorting if the pattern following a shooting star also indicates a price drop. Shooting star patterns, thereby, help traders make trading decisions based on upcoming market trends. \n\nThe three main advantages of shooting stars include the ease of spotting and understanding them and their usefulness in identifying upcoming price trends. The two main disadvantages of shooting star patterns include their tendency to produce false signals from time to time and the need to use more than one candlestick to confirm the price trend. There are totally 35 candlestick patterns of which the seven main ones include the morning star, hammer, inverted hammer, piercing pattern, shooting star, hanging man, and doji.\n\nA shooting star candlestick is a price pattern that is formed when the price of security opens and first advances and then declines and falls to a price close to the opening price. Shooting star candlestick patterns signal the start of a price reversal where the trend begins to turn bearish. Shooting star candlesticks comprise a small body, a long upper tail and a short lower tail. The lower tail is at times absent in some shooting stars. The image below depicts a shooting star candlestick pattern.\n\nThe image shows the body of the candlestick, the long upper tail or wick as well as the short lower wick or tail. The body of the shooting star is the wide part of the candlestick, which represents the difference between the opening and closing prices of the security. The long upper wick represents the advancing price from the opening price to the highest price for the day. The lower short wick represents the drop in price at the market close to the level close to or below the opening price. A shooting star’s body is either green or red in colour. The green body signifies that the opening price is lower than the closing price, although the two are very close. The red body signifies that the opening price is greater than the closing price. While reading a shooting star candlestick pattern, investors and traders must pay attention to three aspects including the active price trend at the opening of the shooting star, the price drop that follows in the latter half of the day, and the need to confirm the trend using the candlesticks from the following days. \n\nThe pattern formed by a shooting star candlestick during the price drop resembles the rapid movement of a shooting star when it comes crashing into the earth’s atmosphere before burning up. \n\nShooting star candlestick patterns tell traders about upcoming bearish trends in the market. Traders who spot shooting star patterns in the candlestick price charts, wait for the following pattern the next day. Traders consider the market trend bearish if the pattern that follows a shooting star candlestick pattern also reflects a price drop. Traders also make trading decisions based on the shooting star patterns. Traders sell or resort to shorting if the patterns following a shooting star pattern also indicate a price drop. ",
      "image": "https://panthitech.github.io/ForexBuySellSignal/Images/Shooting%20Star.png"
    },
    {
      "id": 25,
      "name": "Three Black Crows",
      "text1": "The three black crows candlestick pattern is formed when the market makes three consecutive bearish candles with lower lows. The three black crows pattern is formed at the top of the price chart right after a bullish rally.",
      "text2": "The initial bullish rally in the three black crows creates a sense of optimism among investors, but the subsequent three consecutive bearish candles with lower lows suggest that the bears have taken control of the market. This pattern indicates a potential reversal of the uptrend.\n\nAccording to a study titled “An Analysis of Candlestick Patterns in Market Forecasting” by the research team at the Technical Analysis of Stocks & Commodities (TASC) magazine, the Three Black Crows pattern has a success rate of approximately 78% in predicting bearish reversals. \n\nContinuation Patterns: Continuation patterns in candlestick charts suggest that the current trend will likely continue after a period of consolidation or brief pause. Examples include the Rising Three, Tasuki Gap, and Falling three patterns, each characterized by specific shapes and behaviors that traders use to anticipate the resumption of the prevailing trend. Let’s learn 7 continuation patterns.",
      "text3": "The three black crows have a bearish candlestick pattern that indicates an uptrend reversal. The three black crows pattern occurs when bears outnumber bulls in three consecutive trading sessions. The three black crows have long-bodied, bearish candlesticks that close at or near the period’s low price. They are only considered during an uptrend since they are an uptrend reversal pattern.\n\nOne advantage of using the three black crows pattern is that it signals traders that a trend change is imminent, allowing them to make informed trading decisions. A disadvantage of relying solely on this pattern is that it is only sometimes accurate, as market conditions can quickly change, and the pattern needs to hold true only sometimes.\n\nThe Three Black Crows Candlestick pattern is a bearish reversal pattern consisting of three consecutive long-bodied candles with lower and lower highs. Three black crows occur after an uptrend and are characterized by a strong shift in market sentiment from bullish to bearish. The three candles open near the previous candle’s high and close near the low, indicating consistent selling pressure in the market. Take a look at the image below. \n\nThe above pattern is identified as three black crows for three reasons. The reasons are listed below.\n\nThe pattern is formed during an uptrend. The stock is clearly bullish below the pattern.\nThree long candles are formed, with each one having a lower height than the one before. \nThe candles opened near the previous candle’s high and closed near the low.\nThree black crows here show the reversal of an uptrend. The stock was pushed to bearish territory from a clear uptrend in the chart as well. \n\nThe Three Black Crows candlestick pattern has a counterpart known as the Three White Soldiers, the characteristics of which aid in identifying a bullish reversal or market upswing.",
      "image": "https://panthitech.github.io/ForexBuySellSignal/Images/Three%20Black%20Crows.png"
    },
    {
      "id": 26,
      "name": "Rising Three",
      "text1": "The rising three candlestick pattern is a bullish continuation pattern. During an uptrend, the rising three pattern is characterised by the formation of three candles. The sole requirement for this pattern is that the three small bearish candles must be contained within the range of the first strong bullish candle. The final candle is a strong bullish candle that closes above the first bullish candle. ",
      "text2": "The rising three pattern is formed when the market is in an uptrend, and the bulls maintain their momentum despite a brief pause. The initial bullish rising three pattern candle represents the continuation of the uptrend, and the three small bearish candles that follow suggest a temporary consolidation or pullback within the overall upward movement. The confirmation of an upside trend is considered if the final bullish candle breaks and closes above the close of the first bullish candle. This pattern indicates that the bulls are still in control of the market and that the uptrend is likely to continue.\n\nAccording to a study conducted by the Financial Markets Research Center at Vanderbilt University, published in their report titled “Candlestick Patterns and Their Predictive Power in Financial Markets,” the Rising Three pattern has a success rate of approximately 74% in predicting bullish continuations. ",
      "text3": "The rising three candlestick pattern is a price chart formation that signifies a continuation of the bullish trend. The rising three candlestick pattern occurs in the middle of an ongoing bullish trend, which resumes at the end of the pattern. The rising three candlestick pattern comprises five candlesticks, including a bullish candlestick with a large body, three consecutive bearish candlesticks and a final bullish candlestick that breaks the high of the first candlestick and closes above it. The fifth and final candlestick of the rising three candlestick pattern is considered the decisive candlestick of the pattern as it indicates that the bulls are back in control of the market. \n\nTraders usually enter trading positions at the close of the fifth bar of the pattern. Some traders also prefer to make a trade entry when the fifth candlestick crosses the high of the first candlestick. Traders who prefer more aggressive trading strategies utilize stop-loss orders to minimize their risk of losses. \n\nThe two main advantages of the rising three candlestick pattern include its reliability in predicting short-term price movements and ease of identification. The two main disadvantages of the pattern are the existence of different variations to the pattern and the difficulty of managing risk while using it. \n\nA rising three candlestick is a bullish trend continuation pattern. A rising three candlestick pattern forms on a price chart when there is a pause in an ongoing bullish trend. The bullish trend resumes at the end of the rising three candlestick pattern formation. The most common characteristic of the rising three candlestick pattern is the formation of three bearish candlesticks within an ongoing bullish trend.\n\nThe bearish candlesticks reflect the struggle between the bulls and the bears, wherein the bears try hard to drag the prices lower. The fifth and final bullish candlestick indicates that the bears were unsuccessful in reversing the trend and that the bulls have regained control over the market again. The rising three candlestick signals the resumption of the bullish trend, which is helpful to assess the strength of the bearish trend. \n\nThe rising three candlestick pattern is very useful in helping investors and traders determine whether the ongoing bullish trend will be reversed or resumed. The rising three candlesticks aid investors and traders in assessing the strength of the bullish trend. The bullish trend is considered strong when the bears are unable to reverse the trend and the bulls gain control of the market after the short-lived pause. ",
      "image": "https://panthitech.github.io/ForexBuySellSignal/Images/Rising%20Three.png"
    },
    {
      "id": 27,
      "name": "Falling Three",
      "text1": "The falling three candlestick pattern is a bearish continuation pattern. The falling three pattern consists of three candles and it forms during a downtrend. The only condition of this pattern is that the three small bullish candles must be contained within the range of the first strong bearish candle. The final candle is a strong bearish candle that closes below the low of the first bearish candle. This final setup is considered as a confirmation of a downtrend.",
      "text2": "According to a study published in the “Journal of Technical Analysis” by Dr. Stephen W. Bigalow and his research team, titled “The Predictive Power of Candlestick Patterns in Financial Markets” the Falling Three pattern has a success rate of approximately 72% in predicting bearish continuations. ",
      "text3": "The falling three candlesticks is a bearish candlestick pattern that is used in technical analysis to predict potential reversals or downtrends in the price of a financial instrument. Falling three candlesticks is a relatively rare pattern that consists of five consecutive candlesticks.\n\nUnderstanding the falling three patterns is crucial for traders, even those with limited knowledge of the stock market. This pattern serves as a valuable tool to identify potential market shifts, aiding in decision-making for both experienced traders and newcomers alike.\n\nThe falling three pattern holds significance in trading as it provides traders with actionable insights. Recognizing this pattern empowers traders to make strategic moves, particularly in the context of short-selling. Traders capitalize on the anticipated downtrend and potentially profit from price declines by understanding this pattern. This pattern acts as a guide, indicating the potential future direction of the market and enabling traders to align their strategies accordingly.\n\nThe falling three patterns offer advantages to traders, regardless of their level of expertise. Firstly, its simplicity and visual nature make it accessible to individuals with minimal knowledge of the stock market. This pattern provides a clear signal of potential market reversals, allowing even newcomers to grasp its implications. Additionally, the falling three pattern serves as a versatile tool that can be applied to various timeframes and financial instruments.\n\nThis application enables traders to incorporate it into their trading strategies across different markets. Lastly, the falling three pattern complements other technical analysis tools and indicators, enhancing the overall effectiveness of traders’ analyses. Traders enhance their decision-making capabilities and improve their overall trading performance by leveraging the advantages offered by the falling three patterns.\n\nThe falling three-candlestick pattern is a bearish pattern in technical analysis that gives us hints about price downtrends in a financial instrument. Let us take a look at the falling three-candlestick pattern. The first candlestick is a long black (bearish) candle that signifies an established downtrend. The second, third, and fourth candlesticks are small-bodied, typically white or black, and have their highs and lows within the range of the first candlestick.\n\nOne of the key advantages of the Falling Three Candlestick pattern is its ability to signal potential reversals or continuations of downtrends. It suggests that traders are experiencing a temporary consolidation or correction within an existing bearish trend when this pattern occurs. Traders interpret this as a warning sign that the bearish momentum might continue, allowing them to adjust their trading positions accordingly. This pattern helps traders identify potential entry points for short positions or tighten their stop-loss orders to protect their positions.\n\nThe Falling Three Candlestick pattern is relatively easy to recognize due to its distinct visual appearance. Traders with little experience in technical analysis learn to identify this pattern and incorporate it into their analysis. Its simplicity makes it accessible to traders at different skill levels.\n\nAnother benefit is that this pattern is applied to various timeframes and financial instruments. This pattern remains applicable whether you are analyzing stocks, forex, commodities, or other assets. Its versatility allows traders to utilize it across different markets, enhancing its usefulness in their trading strategies.",
      "image": "https://panthitech.github.io/ForexBuySellSignal/Images/Falling%20Three.png"
    },
    {
      "id": 28,
      "name": "Tasuki Gap",
      "text1": "The Tasuki Gap is a candlestick pattern used in technical analysis to indicate a potential continuation of a market trend. Tasuki Gap patterns can appear as either an Upside Tasuki Gap, which signals a bullish continuation during an uptrend, or a Downside Tasuki Gap, which indicates a bearish continuation during a downtrend. Tasuki Gap patterns consist of three candlesticks: the first candle aligns with the current trend, the second candle creates a gap in the direction of the trend, and the third candle partially fills the gap without closing it, confirming the continuation of the trend.",
      "text2": "The psychology of the Tasuki Gap reflects a transition in market sentiment, capturing the emotional dynamics between buyers and sellers. Tasuki Gap patterns, whether upside or downside, indicate a shift in control, with the gap itself symbolizing a break in momentum, either bullish or bearish. This pattern often signifies a continuation of the prevailing trend, as the market sentiment aligns with the dominant force, be it buyers or sellers, reinforcing the existing trend direction.\n\nAccording to the “Encyclopedia of Candlestick Charts” by Thomas N. Bulkowski, the Upside Tasuki Gap candlestick pattern has a success rate of 57% during intraday trading.",
      "text3": "The Upside Tasuki Gap demonstrates an uptrend’s strength through the gap open of the pattern’s second candle, as well as its escalating price. The pattern’s third candle indicates a pause in the trend as the bears attempt to move the price lower but cannot close the gap between the first and second candle. The bear’s inability to close the gap suggests the uptrend will likely continue.\n\nTraders may also refer to the pattern as a Bullish Tasuki Gap or the Upward Gap Tasuki. Its adverse counterpart, which occurs in a bearish market, is known as a Downward Tasuki Gap. Both patterns are predicted to have originated from Japanese technical analysis.\n\nThe Upside Tasuki Gap is one of many gap patterns that can form throughout a bullish trend. Supporting uptrend gap patterns are also usually used in conjunction with the Upside Tasuki Gap to add confirmation to a bullish trading strategy.\n\nGaps are significant price changes that typically occur from one trading day to the next. Typical gap patterns form over two to three days of trading. It is not uncommon to see the price of an asset close a price gap previously created. Sometimes traders push the price higher too quickly, which can result in a slight pullback. The black/red candlestick that forms the Upside Tasuki Gap acts as a period of minor consolidation before the bulls continue to send the price higher.\n\nThe Tasuki Gap is a three-line bullish continuation pattern belonging to the tasuki patterns family.\n\nIts first line appears as a long line in an uptrend, having a white body.\n\nThe second line may appear as any white candle, either as a long or short line. A price gap exists between first two lines.\n\nThe third line may be any black candle (except doji candles) which opens between prior opening and closing prices. It closes below the prior opening price, however, is not closing the price gap between the first and second line.\n\nThe Upside Tasuki Gap should be confirmed, that is candles following its occurrence should close above second line's closing price.\n\nThe second and third line of the pattern may form the Bearish Tasuki Line acting as a bearish reversal pattern. Therefore considering the market context is very important.",
      "image": "https://panthitech.github.io/ForexBuySellSignal/Images/Tasuki%20Gap.png"
    },
    {
      "id": 29,
      "name": "Mat Hold",
      "text1": "The Mat Hold pattern is a candlestick formation that signals a continuation of the prevailing trend, typically occurring in the middle of an uptrend or downtrend. It consists of five candlesticks: the first is a long candle in the direction of the trend, followed by a gap and three smaller candles that move against the trend, and finally another long candle that resumes the direction of the trend. This pattern indicates a temporary pause or consolidation before the trend continues with renewed strength.",
      "text2": "The psychology behind the Mat Hold pattern reflects a brief period of consolidation or indecision in the market, where the opposing force attempts to reverse the trend but fails. This pattern demonstrates the prevailing trend’s strength, as the initial pause is overcome by renewed momentum in the trend’s direction, reinforcing traders’ confidence in its continuation.\n\nAccording to Thomas N. Bulkowski’s “Encyclopedia of Candlestick Charts” the Mat Hold pattern has a high success rate, with bullish Mat Hold patterns achieving a success rate of approximately 70% in predicting a continuation of the upward trend.",
      "text3": "When the bullish mat hold pattern occurs within an uptrend it signals that the uptrend is likely resuming to upside. Traders may opt to buy near the close of the fifth candle (large up candle) or enter a long trade on the following candle. A stop loss is typically placed below the low of the fifth candle.\n\nWhen a bearish mat hold pattern occurs within a downtrend, it indicates the downtrend is likely resuming and prices will continue to fall. Traders may opt to sell or short near the close of the fifth or on the following candle. A stop loss on short positions is placed above the high of the fifth candle.\n\nBoth versions of the pattern are quite rare. They show that the price is moving strongly in the trending direction (candle one), and there is only minor pressure in the opposite direction (candles two through four) before the price starts moving in the trending direction again (candle five).\n\nThere can be bearish or bullish mat hold patterns. A bullish pattern starts with a large upward candle followed by a gap higher and three smaller candles that move lower. These candles must stay above the low of the first candle. The fifth candle is a large candle that moves to the upside again. The pattern occurs within an overall uptrend.\n\nThe bearish version is the same, except candles one and five are large down candles, and candles two through four are smaller and move to the upside. These candles must stay below the high of the first candle. The pattern completes with a long candle to the downside, candle five. It must occur within a downtrend.",
      "image": "https://panthitech.github.io/ForexBuySellSignal/Images/Mat%20Hold.png"
    },
    {
      "id": 30,
      "name": "Inside Bars",
      "text1": "The Inside Bar pattern is a candlestick formation that occurs when a smaller candle is completely contained within the high and low range of the previous candle. This pattern indicates a period of consolidation or indecision in the market, as the price movement is tighter compared to the preceding period. Inside Bars are often seen as potential signals for a breakout, as they suggest that the market is coiling before a significant move in either direction.",
      "text2": "The psychology behind the Inside Bar pattern reflects a phase of market indecision, where neither buyers nor sellers have taken control. This consolidation phase indicates that traders are waiting for additional information or a catalyst before committing to a direction. The breakout that often follows an Inside Bar pattern can reflect a release of pent-up energy, as traders respond to new developments or shifts in sentiment.\n\nThe Inside Bar pattern has a rich history in technical analysis, with its roots tracing back to early charting techniques used by traders to identify periods of market consolidation. The pattern gained prominence in the trading community through the work of Dan Chesler, who popularized it in articles published in Active Trader magazine and Technical Analyst magazine. This pattern was further advanced by traders like Nial Fuller, a renowned price action trader and coach, who emphasized its effectiveness in trading strategies. ",
      "text3": "An inside bar is a two-candlestick formation that occurs when a candlestick's high and low range is contained within the high and low range of the preceding candle. In other words, the entire price action of one candle is confined within the previous candlestick's price range.\n\nThe setup signifies a period of consolidation or indecision in the market; however, it doesn’t identify a trend reversal. The price may continue moving in the prevailing trend or turn around. Also, the pattern may appear both in an uptrend and in a downtrend. It indicates that the trading range of the current candle is narrower than the range of the previous candlestick. This contraction in price volatility suggests a temporary equilibrium between buyers and sellers.\n\nThe inside bar can be observed across different financial instruments such as stocks, cryptocurrencies*, ETFs, indices, and forex currency pairs and can be traded using contracts for difference (CFDs)\n\nThe inside candle pattern occurs when the high and low of a candle are contained within the range of the preceding candlestick, indicating consolidation or indecision in the market. It suggests a potential reversal or continuation of the current trend. On the other hand, an outside bar, or engulfing pattern, happens when the high and low of a candlestick completely engulf the previous candle, signalling a potential reversal. A bearish engulfing indicates a bearish reversal, while a bullish engulfing suggests a bullish reversal. Both are widely used by traders for technical analysis and identifying potential trading opportunities.",
      "image": "https://panthitech.github.io/ForexBuySellSignal/Images/Inside%20Bars.png"
    },
    {
      "id": 31,
      "name": "Three White Soldiers",
      "text1": "The three white soldiers candlestick pattern is formed when the market makes three consecutive bullish candles with higher closes. The three white soldiers pattern is formed at the bottom of the price chart after a bearish rally.",
      "text2": "The three white soldiers pattern is formed when the market experiences a significant shift in sentiment from bearish to bullish. The initial bearish decline in three white soldiers creates a sense of pessimism among investors, but the subsequent three consecutive bullish candles with higher closes suggest that the bulls have taken control of the market. This pattern indicates a potential reversal of the downtrend.\n\nAccording to a study titled “Candlestick Patterns and Market Trends: An Empirical Study” by the Technical Analysis Research & Education (TARE) Foundation, the Three White Soldiers pattern has a success rate of approximately 82% in predicting bullish reversals",
      "text3": "Three white soldiers is a candlestick pattern, often referred to as a “bullish” candlestick pattern.  Three white soldiers are used in technical analysis to identify potential buying opportunities. This pattern develops when three continuous long bullish candles indicate a strong upward trend on a chart. The opening price of each candlestick should also be above the previous day’s high.\n\nMarket participants consider this pattern a reliable bullish reversal pattern because it indicates buyers are taking control of the market and pushing higher prices. This technical analysis pattern is not foolproof, and traders should always use it with other technical and fundamental analysis tools to confirm the trend.\n\nThe “Three White Soldiers” is a bullish candlestick pattern that appears on a chart, and traders use it to identify potential trend reversals or the continuation of an existing uptrend. Three long-bodied candlesticks with little to no shadow at the top or bottom close successively higher than the preceding candlesticks to form the pattern. \n\nThe three white soldiers is formed when the price action consists of three consecutive long-bodied candles that close near their highs with little or no wick. This suggests buyers were in control during each session, continuously bidding the price higher. The pattern shows strong and persistent buying pressure that overwhelms selling pressure. Prior reversal signals like doji candles may precede the emergence of this pattern. The three white soldiers pattern implies existing downtrends may reverse as buyers gain control and start pushing the asset higher. However, as with any technical analysis indicator, it should be combined with other signals to confirm the emergence of a new uptrend. This bullish multi-candlestick formation is the opposite of the bearish three black crows pattern. This type of triple candlestick pattern indicates that the downtrend is possibly over and that a new uptrend has started.",
      "image": "https://panthitech.github.io/ForexBuySellSignal/Images/Three%20White%20Soldiers.png"
    },
    {
      "id": 32,
      "name": "Marubozu",
      "text1": "A marubozu candlestick pattern has the potential to be both bullish and bearish. The morubozu candlestick pattern is achieved when a candle opens at the low or high of the previous candle and closes at the opposite end without leaving any wicks.",
      "text2": "In a bullish marubozu pattern, the candle opens at the low of the previous candle and closes at the high, without any wicks. This indicates that the buyers have been in complete control, driving the price higher throughout the trading session. During this session, High = Close and Low = Open.\nConversely, a bearish marubozu pattern, where the candle opens at the high and closes at the low without any wicks, suggests that the sellers have been in control, pushing the price lower. During this session, High = Open and Low = Close.\n\nAccording to a study conducted by the Financial Markets Research Center at Princeton University, published in their report titled “The Efficacy of Candlestick Patterns in Market Forecasting,” the Marubozu pattern has a success rate of approximately 69% in predicting subsequent market direction, whether bullish or bearish. \n\nIndecision Patterns: Indecision patterns in candlestick charts indicate uncertainty in the market, where neither buyers nor sellers have a clear advantage. Examples include the Doji, Spinning Top, and Long-Legged Doji patterns, each characterized by small bodies and long wicks, reflecting a balance between buying and selling pressure. Let’s learn about 8 indecision patterns.",
      "text3": "Marubozu is a non-shadow candlestick charting formation that occurs when the opening and closing prices of a stock are the same or very close to each other. Marubozu also occurs when the stock price does not trade outside the range of the opening and closing prices during the trading session. This pattern is significant in technical analysis as it is believed to indicate strong bullish or bearish sentiment in the market, depending on the color of the candlestick. \n\nThe invention of the Marubozu candlestick is often attributed to Munehisa Homma, a Japanese rice trader who lived from 1724 to 1803 and is considered the father of Japanese candlestick charting. Marubozu is a Japanese term that means “close-cropped,” and it refers to a candlestick that has a very small or no upper and lower shadow. \n\nThe Marubozu is a candlestick pattern that shows the market’s determination to move primarily in one direction without encountering significant opposition from the other side. A Marubozu pattern often forces a conclusion at the high or low of the session. \n\nThe term Marubozu  “close-cropped” or “shaved,” refers to the fact that the candlestick has no upper or lower shadow. A marubozu is a strong indication of a bullish or bearish trend, depending on whether it is a white or black candlestick. \n\nMarubozu is a type of candlestick that has no wicks, meaning the high and low of the candle are the same as the open or close price. \n\nA red marubozu occurs when the opening price is the highest point of the session, and the closing price is the lowest point of the session, indicating a strong bearish sentiment.\n\nA green marubozu occurs when the opening price is the lowest point of the session, and the closing price is the highest point of the session, indicating a strong bullish sentiment.\n\nYou can see that the candle formed no wicks in both cases. \n\nA Marubozo in an uptrend indicates that bulls are aggressively buying the asset and may continue upward. A bearish Marubozo in a downtrend (open equals high, low equals close) at the top of an uptrend indicates more selling pressure.",
      "image": "https://panthitech.github.io/ForexBuySellSignal/Images/Marubozu.png"
    },
    {
      "id": 33,
      "name": "Doji",
      "text1": "The doji candlestick pattern is characterised by the price of a stock opening and closing at nearly the same level. Doji candlestick patterns are exceedingly straightforward to identify due to their nearly nonexistent body.",
      "text2": "The doji pattern is formed when the market is in a state of indecision, with neither the bulls nor the bears able to gain a clear upper hand. This indecision in the doji pattern is reflected in the opening and closing prices being almost identical, resulting in a candlestick with an extremely small or nonexistent body. This pattern suggests a potential shift in market sentiment and a possible reversal in the immediate future.\n\nAccording to a study published in the “Journal of Financial Markets” by Dr. Paul Weller and his research team titled “The Predictive Power of Candlestick Patterns: A Comprehensive Study,” the Doji pattern has a success rate of approximately 55% in predicting market reversals. ",
      "text3": "Doji is a type of price chart pattern in which the opening and closing prices of security are practically equal. Doji candlestick patterns resemble a plus sign or a cross owing to the equal open and close price. Doji candlesticks are formed when a security price opens, fluctuates to a high and low and then closes at a point that is the same level as the opening price. \n\nDoji candlestick patterns are of six main types including the gravestone doji, the long-legged doji, the dragonfly doji, the standard doji, the 4-price doji and the neutral doji. Doji candlesticks are classified depending on the position of the horizontal open-close price line. All six types of doji happen when the opening and closing price of a particular security falls on the same level on the price chart. \n\nDoji patterns are read and interpreted based on the type of doji that appears on the price chart. There are three principal ways of interpreting doji patterns which include indecision, a continuation of the present trend and a possible trend reversal. To trade with doji candlestick patterns, investors and traders first determine the type of doji pattern that is present and then decide on the trading strategy. The two commonly used strategies for doji patterns include stop-loss orders and shorting. \n\nThe four main advantages of doji patterns include their ability to guide investors through possible trend reversals, ease of identification, accuracy and their ability to be used in all timeframes. Doji candlestick patterns also involve two primary disadvantages including the tendency to produce false positives and the waiting period it takes to confirm the upcoming market trends it signals. Other popular candlestick patterns include spinning top, shooting star, hammer, hanging man, evening star etc. \n\nA doji is a pattern that is formed in candlestick price charts wherein the opening and closing price of a security is equal or show very minute variation. Doji candlesticks derive their name from the Japanese term ‘doji’ which means a mistake, or error, referring to the rare chance of a security having an equal or almost equal opening and closing price.  Doji candlesticks are principally considered neutral signals that reflect the state of indecision existing in the market. A doji candlestick pattern is shaped like a plus sign or a cross. The lengths of the horizontal and vertical lines of a doji candlestick vary depending on the opening price, the high, the low and the closing price. The image below shows the basic structure of a doji candlestick. ",
      "image": "https://panthitech.github.io/ForexBuySellSignal/Images/Doji.png"
    },
    {
      "id": 34,
      "name": "Gravestone Doji",
      "text1": "Gravestone doji candlestick pattern indicates a potential bearish trend reversal. Gravestone doji is generally formed at the top of the price chart. Traders interpret this pattern as a sign to take a bearish trade in the underlying stock.",
      "text2": "The gravestone doji pattern is formed when the market experiences a strong bullish momentum followed by a sudden rejection of the higher prices. The opening and closing prices being nearly identical, with a long upper wick and no lower wick, suggests that the bulls were unable to maintain the upward pressure, and the bears were able to push the price back down. This pattern signals a potential shift in market sentiment from bullish to bearish.\n\nAccording to a study published in the “Journal of Technical Analysis” by Dr. Thomas Bulkowski, a renowned expert in chart patterns, titled “Performance and Reliability of Candlestick Patterns,” the Gravestone Doji pattern has a success rate of approximately 61% in predicting bearish reversals.",
      "text3": "Gravestone Doji is a bearish candlestick used by traders for technical analysis. Gravestone Doji is a candlestick pattern observed when the opening and closing value of the asset is equal, which occurs at the low of the day. The longer the upper shadow of the Gravestone Doji, the more bearish the pattern is considered to be, as it suggests that the selling pressure was strong and overwhelmed the buying pressure.\n\nDoji is a commonly found candlestick pattern in which the price of the asset closes and opens at the same point. Doji is represented with the help of a small candle having a relatively very small real body on the charts. The shapes of these candles are then analysed by traders to make decisions about price movements. \n\nOn May 22nd, 2015, an Indian company called Adani Ports formed a Gravestone Doji in its daily charts. This pattern is commonly seen in the stock market. The Gravestone Doji was formed with an initial dominance of bears with an uptrend from the levels of 300 to 348. The market experienced a 16% increase on this day but later dropped from 350 to 298 as the Gravestone Doji formed. This was another drop of about 15 percent. Gravestone Doji can be clearly observed in the below chart, it is formed at the top of the uptrend and denotes a bearish reversal of trend. The general property that defines this Japanese candlestick is a small real body with an extremely long upper shadow (similar to an inverted ‘T’).\n\nThe Gravestone Doji is a bearish Doji, which is observed when the opening and closing price of a security is equal during a trading session. The Gravestone Doji is initiated with an uptrend, which is denoted with a long upper shadow. The Gravestone Doji got its name because the pattern resembles a gravestone with an unusually long shadow pointing upwards.\n\nThe Gravestone Doji is considered one of the most significant Doji, which indicates a shift in the market sentiments from bearish to bullish. It is typically seen as a bearish reversal pattern and occurs after an uptrend. The pattern is formed when the security market opens up at a higher price than the previous day’s close, but prices start to fall after the uptrend and close at or near the same level as the open, with a long upper shadow. This Doji indicates the change in the market sentiment, where at first the market was dominated by buyers, because of which an uptrend was followed.The price fell later on because the market was dominated by sellers, because of which this pattern is known as the bearish reversal pattern. The long upper shadow of the candlestick indicates that there was significant selling pressure during the trading session.\n\nThe reason why Gravestone Doji is considered as one of the most significant Doji is because it represents the balance between Bears and Bulls during a trading session. The history of gravestone doji dates back to the early 1700s, it was developed by the Japanese for analysing rice trading. Candlestick charts were created by the Japanese as a tool for market analysis, which offered a visual representation of price action and enabled traders to spot patterns and trends. This method was used by Japanese traders to find trends, in order to maximize their profit by the price movement. The Gravestone Doji was one of the many Doji’s developed by the Japanese traders for trading goods.\n\nThe Gravestone Doji became famous in the modern-day trading during 1980s because of the efforts of Steve Nison. Steve brought Japanese candlestick charting to Western traders in his book “Japanese Candlestick Charting Techniques,” candlestick charting and the use of patterns like the Gravestone Doji became more common in the West during this time. Traders from all over the world have started to use candlestick charting as a common technical analysis instrument, after Steve’s contribution.\n\nThe Gravestone Doji has developed into one of many candlestick formations that traders employ when examining the markets. Candlestick charting may have started more than 300 years ago in Japan, but it is still a vital tool for traders of all types today. It is constantly evolving and adapting to shifting market conditions.",
      "image": "https://panthitech.github.io/ForexBuySellSignal/Images/Gravestone%20Doji.png"
    },
    {
      "id": 35,
      "name": "Dragonfly Doji",
      "text1": "Dragonfly doji candlestick pattern indicates a potential bullish trend reversal. Dragonfly doji is generally formed at the bottom of the price chart. Traders interpret this pattern as a signal to take a bullish trade in the underlying stock.\n\n",
      "text2": "The dragonfly doji pattern is formed when the market experiences a strong bearish momentum followed by a sudden rejection of the lower prices. The opening and closing prices being nearly identical, with a long lower wick and no upper wick in dragon fly doji, suggests that the bears were unable to maintain the downward pressure, and the bulls were able to push the price back up. This pattern signals a potential shift in market sentiment from bearish to bullish.\n\nAccording to a study by the Financial Markets Research Group at MIT, published in their report titled “Candlestick Patterns and Market Forecasting: An Empirical Study,” the Dragonfly Doji pattern has a success rate of approximately 60% in predicting bullish reversals. ",
      "text3": "Dragonfly Doji is a candle pattern with no real body and a long downward shadow. A Dragonfly Doji indicates a potential price reversal to the downside or upside, depending on previous price action. It occurs when the asset’s high, open, and close prices are uniform.\n\nThe long lower shadow indicates that there was some assertive selling during the timeframe of the candle. As the price closes near the open, the buyers absorb the selling pressure and push the prices back up.\n\nThe Dragonfly Doji candle is formed by any standard Doji candle with a very small body and a large shadow only on the lower side. The opening and closing prices are quite the same or similar because the body is small. The lower shadows are significantly longer than the candle’s body, which comprises the opening and closing prices. As a result, the low price is proportionately distant from the open, high, and close prices whereas the open, high, and close prices are comparable.\n\nA Dragonfly Doji is a candlestick pattern recognized by the open, high, and close prices that are equal or very close to one another, while the low price of the period is much lower than the previous three. The traders can quickly identify the “T” shape formed due to the lower shadow. The formation of a Dragonfly Doji after a price gain is a warning of a potential price decline. A move lower on the next candle gives confirmation.\n\nA Dragonfly Doji, after a price drop, warns that the price may rise. The rise of the succeeding candle provides the required confirmation for a price rise. \n\nThe Dragonfly Doji is a reliable sign of a trend reversal when it appears at the bottom of a downtrend. This is due to the price reaching a support level during the trading day, which suggests that the market’s sellers are no longer outnumbering the buyers.\n\nA bullish movement may occur the next day if the asset is considered to be oversold, necessitating additional technical indicators. This may be an opportunity for additional entry points, particularly if the market opens higher the next day.",
      "image": "https://panthitech.github.io/ForexBuySellSignal/Images/Dragonfly%20Doji.png"
    },
    {
      "id": 36,
      "name": "Long Legged Doji",
      "text1": "A long legged doji pattern resembles the indecision between the market participants. A long legged doji pattern can form at the top of the chart as well as the bottom of the chart.",
      "text2": "The long-legged doji pattern is created when the open and close prices are nearly identical, but the asset experiences a wide trading range during the session. This shows that the bulls and bears were in a state of equilibrium, unable to establish a clear direction for the market. The long upper and lower wicks suggest that both sides made attempts to push the price in their favor, but ultimately failed to gain a decisive advantage.\n\nAccording to a study published in the “Journal of Behavioral Finance” by Dr. David Aronson and his research team, titled “The Efficacy of Candlestick Patterns in Financial Markets,” the Long-Legged Doji pattern has a success rate of approximately 57% in predicting subsequent market reversals.",
      "text3": "The Long Legged Doji is a neutral candlestick formation that indicates market indecision. The long-legged Doji is distinguished by a long upper and lower shadow, as well as a small real body in the centre. Long shadows indicate significant price movement during the period, with buyers and sellers pushing the price up and down. The small real body demonstrates that the opening and closing prices were extremely close, indicating that there was no clear winner in the battle between buyers and sellers.\n\nThe long-legged doji pattern has the advantage of signaling a potential price reversal. The pattern is formed when the opening and closing prices are the same and there is significant price movement during the trading session. This indicates market indecision and may result in a price reversal. The long-legged doji pattern has the disadvantage of signaling continued price volatility. Price movements become unpredictable if the market remains indecisive and swings back and forth between bullish and bearish sentiment. making it difficult for traders to make informed decisions. Long-legged doji patterns are also uncommon, making them difficult to recognise and act on.\n\nA Long Legged Doji is a type of Doji candlestick pattern with longer wicks that indicate a price reversal. The Long Legged Doji has long upper and lower shadows, indicating that there was significant price movement during the period. The below image depicts how the pattern looks,\n\nThe Long Legged Doji is significant because it signals indecision in the market. Buyers and sellers were actively buying and selling during the period, but the open and closed prices were the same, indicating that neither side was able to gain the upper hand. This can be a valuable signal for traders, as it indicates that the market may be about to undergo a significant price movement.\n\nThe Long Legged Doji is formed when the opening and closing prices are almost exactly the same, creating a small real body in the middle of the candlestick. The Long Legged Doji has long upper and lower shadows, indicating significant price movement during the period, unlike other Doji formations.\n\nLet’s say that you are an investor who is analyzing the stock prices of a particular company over a one-day period. The opening price of the stock was Rs. 500, and it fluctuated throughout the day before closing at Rs. 500 again. But the stock’s price went as high as Rs. 550 and as low as Rs. 450 during the day, indicating a lot of volatility in the market. ",
      "image": "https://panthitech.github.io/ForexBuySellSignal/Images/Long%20Legged%20Doji.png"
    },
    {
      "id": 37,
      "name": "Bullish Spinning Top",
      "text1": "A bullish spinning top candlestick pattern presages a potential trend reversal from a downtrend to an uptrend. The price of a bullish spinning top fluctuates significantly on both its upper and lower sides; however, the candle opens and closes at approximately the same price.",
      "text2": "The bullish spinning top pattern is formed when the market experiences a significant amount of indecision and volatility during the trading session. The wide range between the high and low prices, coupled with the open and close being near the same level, suggests that neither the bulls nor the bears were able to gain a decisive advantage. This pattern indicates a potential shift in market sentiment from bearish to bullish.\n\nAccording to a study conducted by the Technical Analysis Research & Education (TARE) Foundation, titled “The Predictive Power of Candlestick Patterns in Financial Markets,” the Bullish Spinning Top pattern has a success rate of approximately 54% in predicting bullish reversals. ",
      "text3": "A bullish trend occurs when stock prices are rising and investors are confident about the stock’s future. It is the inverse of a negative trend, in which stock values are declining and investors are pessimistic about the stock’s future. Typically, a 20% or greater shift from a recent peak or trough signals the start of a “official” bear or bull market.\n\nIt’s critical to understand market trends and trading tactics in order to maximise gains when trading in a bullish market. The first step is to recognise the trend by looking for a series of higher highs and higher lows in price movements, which indicates that the market is in an uptrend. You can select securities that are likely to gain from the bullish trend once the trend has been discovered, such as equities or ETFs that track the general market or specific sectors.\n\nAn example of a bullish market is when stocks began a bull market in March 2009, in the midst of the Great Recession, and it lasted until COVID-19 completely shut down the global economy in March 2020.\n\nThe indication of a bullish spinning top is that the stock could be bottoming out and the price start to rise soon. The bullish spinning top usually appears after a long run of a bearish trend. The pattern suggests that the bear is reversing to a bull. The pattern is a sign of indecision in the market, and the bulls and bears are evenly matched. But the bulls start to take control soon, leading to a bullish trend in the market. ",
      "image": "https://panthitech.github.io/ForexBuySellSignal/Images/Bullish%20Spinning%20Top.png"
    },
    {
      "id": 38,
      "name": "Bearish Spinning Top",
      "text1": "Bearish spinning top candlestick pattern indicates a potential trend reversal from uptrend to downtrend. Bearish spinning top experiences wild price movements on both its upper and lower side. But at the same time, the candle opens and closes almost at the same price.",
      "text2": "The bearish spinning top pattern is formed when the market experiences a significant amount of indecision and volatility during the trading session, similar to the bullish spinning top. The wide range between the high and low prices, coupled with the open and close being near the same level, suggests that neither the bulls nor the bears were able to gain a decisive advantage. This pattern indicates a potential shift in market sentiment from bullish to bearish.\n\nAccording to a study published in the “International Journal of Financial Studies” by Dr. Robert Engle and colleagues, titled “Candlestick Patterns and Their Predictive Power,” the Bearish Spinning Top pattern has a success rate of approximately 53% in predicting bearish reversals.",
      "text3": "Bearish Spinning top candlestick pattern shows uncertainties around an underlying asset. The shadows or wicks will indicate any decisive trend reversal and necessary information for trading strategy. A bearish spinning top is generally colored red. It has a long red body followed by 3 small green bodies followed by another red body. The colors are helpful to identify separately in a candlestick chart. This indicates a falling three-methods bearish pattern.\n\nBearish Spinning tops are candlesticks with 3 components. The small real body of the candlestick shows the opening and closing prices of the day. A short real body means both opening and closing prices are very similar to each other. The short real body indicates that there was a lot of indecision in the market regarding the direction of the price. The body is formed by horizontal lines in a candlestick pattern. The Upper wick or the Upper shadow represents the highest price. A tall upper shadow means that the bulls tried to push the market higher but did not succeed.\n\nThis indicates that the price moves during the period but goes back down. This is viewed as a failed attempt by the bulls to push the markets higher and as a bearish signal. The wick is formed by a vertical line in a candlestick pattern. The lower wick or lower shadow represents the lowest price. The lower shadow indicates that the bears tried to push the market lower but did not succeed. A long red candle indicates that the bears are successful. This is viewed as a failed attempt by the bears to drive the markets down.\n\nBear factors are futile to make the market move in a single direction, resulting in market indecision. The components of a bearish spinning top will help in indicating that the price will fall likely and the sellers are back in control.",
      "image": "https://panthitech.github.io/ForexBuySellSignal/Images/Bearish%20Spinning%20Top.png"
    },
    {
      "id": 39,
      "name": "Tri-Star",
      "text1": "The Tri star candlestick pattern is a potential trend reversal pattern. The tri star pattern can be bearish as well as bullish. If this pattern is formed on the bottom of the chart, it becomes a bullish pattern and vice versa.",
      "text2": "The tri-star pattern is formed when the market experiences a high degree of uncertainty and indecision. The pattern consists of three consecutive doji or doji-like candlesticks, suggesting that neither the bulls nor the bears were able to gain a decisive advantage during the trading sessions. This pattern signals a potential shift in market sentiment and the possibility of a trend reversal.\n\nAccording to a study published in the “Journal of Financial Research” by Dr. Carol Osler and her research team, titled “The Effectiveness of Candlestick Patterns in Predicting Market Trends,” the Tri Star pattern has a success rate of approximately 62% in predicting trend reversals.",
      "text3": "A tri-star doji pattern, as the name suggests, consists of three doji candlesticks. The doji candlesticks represent a symbol of uncertainty in the market. The tri-star doji thus holds significance as it indicates the market is undergoing indecisiveness. The three consecutively formed doji candlesticks are considered a pattern of a trend reversal, either bullish or bearish. The tri-star doji pattern forms at the end of a trend and has unique characters of its own. \n\nThe first doji candlestick represents the indecisiveness of the buyers and sellers in the market. The second doji candlestick represents the gap between the trend that was continuing and the trend reversal that is going to take place. The third doji indicates a change in market sentiments.The middle doji candlestick will appear above the first and the third doji candlestick if the tri-star pattern formed is bearish and the middle doji candlestick will appear below the first and the third doji if the pattern formed is bullish \n\nThe tri-star doji pattern is considered a weak signal for trend reversal as compared to the other trend reversal signs. The three-star doji is still widely used by traders to enter and exit positions. The accuracy of the tri-star doji will be increased with more market signals and tools.",
      "image": "https://panthitech.github.io/ForexBuySellSignal/Images/Tri-Star.png"
    },
    {
      "id": 40,
      "name": "Long Wicks",
      "text1": "The Long Wick pattern in candlestick charts is characterized by a candlestick with a long wick, or shadow, extending significantly beyond the body of the candle. This pattern indicates that during the trading period, there was a substantial price movement that was ultimately rejected, with the closing price moving back towards the opening price. Long wicks can appear at the top or bottom of a candlestick, suggesting potential reversals or shifts in market sentiment.\n\n",
      "text2": "The psychology behind Long Wick patterns involves a battle between buyers and sellers, where one side initially gains control, pushing the price to an extreme level. However, the opposing side regains momentum, driving the price back towards the opening level, which reflects indecision or rejection of the extreme price. A long upper wick suggests that sellers eventually overpowered buyers, while a long lower wick indicates that buyers managed to overcome initial selling pressure.",
      "text3": "Trading with long wick candlesticks occurs when prices undergo testing but are ultimately rejected. These wicks signify levels of rejection. Prior to observing a long lower wick, there’s typically a long bearish candle where bears dominate, followed by bulls exerting pressure to reverse the trend upward. As prices start to rise, a pronounced lower shadow or tail emerges, transforming the prior bearish candle into one with a long tail. Conversely, a long upper wick candlestick begins with a bullish candle, but as bears take control, prices decline, revealing a prominent upper wick or shadow.\n\nTypically, the upper and lower wicks of candlesticks aren’t of equal length. However, there are occasions when neither wick surpasses the other. In such instances, the candlestick exhibits a long upper wick and an extended tail, yet the body is small. This formation is referred to as a spinning top, indicating a potential stalemate between bulls and bears, both of whom have been actively trading.\n\nAt times, candlesticks may lack any wick or tail altogether. Such candlesticks are known as Marubozu Candlesticks. A red Marubozu occurs when the opening price equals the high, and the closing price equals the day’s low, indicating a bearish sentiment. Conversely, a green Marubozu represents a bullish sentiment, where the opening price equals the low and the closing price equals the day’s high.\n\nThese conditions highlight the versatility of wick trading, encompassing not only long or short wicks and tails but also instances with no wicks or equal long wicks and tails. Wick trading holds significant importance as wicks provide insights into supply-demand dynamics, market sentiment, and factors influencing price changes.\n\nIdentifying long wick candles involves several key steps:\n\nLong wick candles are easily recognizable by their extended candle wicks.\nLook for candles with long wicks that are notably longer than others on the same day.\nIdentify price levels likely to align with the long wicks, indicating potential support and resistance levels.\nUtilize these identified levels in conjunction with the long wicks to assess trade opportunities effectively.\n\nLong wick candles are significant because they often signal important price rejection or reversal points in the market. When a long wick forms, it signifies significant price movement in one direction during the trading period, followed by a reversal back in the opposite direction, often erasing most or all of the gains or losses incurred.\n\nFor instance, let’s consider a long upper wick candle in an uptrend. This candle indicates that buyers initially drove the price higher, but by the period’s end, strong selling pressure pushed it back down, closing near or below the opening price. This suggests a potential loss of momentum in the uptrend, potentially signalling a reversal to a downtrend.\n\nSimilarly, a long lower wick candle in a downtrend suggests that sellers initially pushed the price lower, but by the period’s end, strong buying activity pushed it back up, closing near or above the opening price. This implies a potential loss of momentum in the downtrend, potentially signalling a reversal to an uptrend.\n\nIn both scenarios, long wick candles reflect significant indecision or a battle between buyers and sellers at that price level. This serves as a signal for traders to take notice, as it could indicate a potential change in trend direction or the continuation of the current trend, depending on various factors and market context.",
      "image": "https://panthitech.github.io/ForexBuySellSignal/Images/Long%20Wicks.png"
    }
  ]
}
